class Icecream{
  final int id;
  final String name;
  final String iconImage;
  final String type;
  final String ingredient;
  final String description;
  final String image;

  Icecream({
    this.id,
    this.name,
    this.iconImage,
    this.type,
    this.ingredient,
    this.description,
    this.image,
  });
}
List<Icecream> icecream = [
  Icecream(
      id : 21,
      name: "ไอติมมะพร้าว",
      iconImage:"assets/images/s21.png",
      type: "ไอศกรีม&ของหวาน",
      ingredient:
      "1.นมสด 250 กรัม\n"
          "2.วิปปิ้งครีม 250 กรัม\n"
          "3.น้ำมะพร้าว 250 กรัม\n"
          "4.น้ำตาลทราย 185 กรัม\n"
          "5.เกลือป่น ¼ ช้อนชา\n"
          "6.เนื้อมะพร้าวอ่อน",
      description:
      "1.นำหม้อตั้งไฟอ่อน ใส่นมสด วิปปิ้งครีม น้ำมะพร้าว น้ำตาลทรายและเกลือ ลงไปต้มจนเดือด\n"
          "2.เติมเนื้อมะพร้าวลงไปแล้วต้มให้เดือดอีกครั้ง\n"
          "3.พักส่วนผสมให้เย็น เทส่วนผสมลงกล่องพลาสติก แล้วนำไปแช่ช่องฟรีซ นำออกมากวนทุก 1 ชั่วโมง จนกว่าจะได้ไอศกรีมเนื้อเนียนนุ่ม พร้อมเสิร์ฟ",
      image:"assets/images/21.png"
  ),
  Icecream(
      id : 22,
      name: "ไอติมช็อกโกแลต",
      iconImage:"assets/images/s22.png",
      type: "ไอศกรีม&ของหวาน",
      ingredient:
      "1.นมข้นหวาน 80 มิลลิลิตร\n"
          "2.ผงโกโก้  5 ช้อนโต๊ะ\n"
          "3.นมข้นจืด 80 มิลลิลิตร\n"
          "4.นมสดรสจืด 80 มิลลิลิตร",
      description:
      "1.นำนมสดไปอุ่นในไมโครเวฟให้พออุ่น นำผงโกโก้ผสมลงไปในนมอุ่น คนให้ผงโกโก้ละลาย\n"
          "2.เติมนมข้นหวานและนมข้นจืดลงไป ผสมให้เข้ากันแล้วเทใส่กล่องพลาสติก\n"
          "3.นำส่วนผสมไปแช่ในช่องฟรีซ นำออกมาคนทุกๆ 1 ชั่วโมงจนกว่าไอศกรีมจะเนียน พร้อมเสิร์ฟ",
      image:"assets/images/22.png"
  ),
  Icecream(
      id : 23,
      name: "ไอติมสตรอเบอรี่",
      iconImage:"assets/images/s23.png",
      type: "ไอศกรีม&ของหวาน",
      ingredient:
      "1.สตรอเบอรี่ 15 ลูก\n"
          "2.นมสด 200 มิลลิลิตร\n"
          "3.วิปปิ้งครีม 200 มิลลิลิตร\n"
          "4.เกลือ 1 หยิบมือ\n"
          "5.ไข่ไก่ 1 ฟอง\n"
          "6.มะนาว 1 ช้อนโต๊ะ\n"
          "7.น้ำตาลทราย 80 กรัม แบ่ง ไปบมสตอเบอร์รี่ครึ่งหนึ่ง และอีกครึ่งเป็นส่วนผสมของนม",
      description:
      "1.นำสตรอเบอรี่สดไปแช่แข็ง เมื่อแข็งแล้วนำมาบมด้วยน้ำตาลและมะนาว บมทิ้งไว้ 30 นาที\n"
          "2.ระหว่างรอสตรอเบอรี่ที่บมไว้ ให้นำไข่ไก่ใส่ลงไปในอ่างผสม ใส่น้ำตาลทรายและเกลือลงไป ตีจนขึ้นฟูเป็นสีขาว\n"
          "3.เทนมสดลงไปในไข่ที่ตีไว้ คนให้เข้ากัน นำสตรอเบอรี่ที่บมไว้ได้ที่แล้ว ใส่ลงไปในชามผสม\n"
          "4.นำส่วนผสมทั้งหมดลงปั่น ไม่ต้องให้สตรอเบอรี่ละเอียดมาก\n"
          "5.นำส่วนผสมเทลงกล่องถนอมอาหารที่มีฝาปิดมิดชิด ตามด้วยวิปปิ้งครีม คนให้เข้ากัน\n"
          "6.นำไปแช่ตู้เย็นในช่องแช่แข็ง แช่ 2 ชั่วโมงให้นำออกมากวน แล้วนำเข้าตู้เย็นอีกครั้ง แช่ไว้ 5 ชั่วโมงก็ใช้ได้ หรืออาจจะใช้เวลามากกว่านั้น ขึ้นอยู่กับตู้เย็น จากนั้นจัดจาน พร้อมเสิร์ฟ",
      image:"assets/images/23.png"
  ),
  Icecream(
      id : 24,
      name: "วาฟเฟิลไอศกรีม",
      iconImage:"assets/images/s24.png",
      type: "ไอศกรีม&ของหวาน",
      ingredient:
      "1.ไข่ไก่ 3 ฟอง\n"
          "2.น้ำตาลทราย 100 กรัม\n"
          "3.แป้งสาลีอเนกประสงค์ 150 กรัม\n"
          "4.ผงฟู 1 ช้อนชา\n"
          "5.นมสด 300 มิลลิลิตร\n"
          "6.เนย 50 กรัม\n"
          "7.กลิ่นวานิลลา 1 ช้อนชา\n"
          "8.ไอศกรีมตามชอบ\n"
          "9.ซอสคาราเมล\n"
          "10.ซอสช็อกโกแลต\n"
          "11.ท็อปปิ้งตามชอบ\n"
          "12.น้ำตาลไอซิ่ง\n"
          "13.เครื่องทำวาฟเฟิล",
      description:
      "1.ตีไข่ไก่กับน้ำตาลทรายให้ขึ้นฟู\n"
          "2.ใส่แป้งสาลีอเนกประสงค์ ผงฟู (ที่ร่อนเอาไว้แล้ว) นม เนยละลาย และกลิ่นวานิลลา ตีจนเข้ากัน\n"
          "3.ทาเนยที่เครื่องทำวาฟเฟิล เทส่วนผสมแป้งลงไปพอประมาณ อบวาฟเฟิลประมาณ 2 นาที\n"
          "4.พอได้วาฟเฟิล ก็จัดการใส่ไอศกรีมตามชอบลงบนวาฟเฟิล ราดซอสคาราเมล\n"
          "5.นำวาฟเฟิลอีก 1 แผ่นมาทับไอศกรีม แล้วใส่ท็อปปิ้งตามชอบ\n"
          "6.ราดซอสช็อกโกแลต โรยไอซิ่งตกแต่ง พร้อมเสิร์ฟ",
      image:"assets/images/24.png"
  ),
  Icecream(
      id : 25,
      name: "ไอศกรีมแพนเค้ก",
      iconImage:"assets/images/s25.png",
      type: "ไอศกรีม&ของหวาน",
      ingredient:
      "1.ไข่แดง 4 ฟอง\n"
          "2.กลิ่นวานิลลา ½ ช้อนชา\n"
          "3.นมข้นจืด 50 กรัม\n"
          "4.แป้งเค้ก 60 กรัม\n"
          "5.ผงฟู ½ ช้อนชา\n"
          "6.เกลือ ¼ ช้อนชา\n"
          "7.เนยจืดละลาย 2 ช้อนโต๊ะ\n"
          "8.ครีม ออฟ ทาร์ทาร์ ½ ช้อนชา\n"
          "9.ไข่ขาว 4 ฟอง\n"
          "10.น้ำตาลทราย 30 กรัม\n"
          "11.ท้อปปิ้งตามชอบ",
      description:
      "1.ทุบน้ำแข็งแห้งให้ละเอียด\n"
          "2.ผสมวิปปิ้งครีม เกลือ และ นมข้นหวาน\n"
          "3.ใส่น้ำแข็งแห้งป่นละเอียดลงในส่วนผสมไอศกรีม คอยคนเรื่อย ๆ เพื่อให้ความเย็นกระจายอย่างทั่วถึง\n"
          "4.เมื่อส่วนผสมจับตัวเป็นไอศกรีมแล้ว ตักเป็นลูกใส่ไว้ในช่องแช่แข็ง\n"
          "5.ร่อนแป้งเค้ก ผงฟู และเกลือ ผสมกับไข่แดง เนยจืดละลาย และ ข้นจืด คนให้เข้ากันแล้วพักไว้ในตู้เย็นนาน 10 - 15 นาที\n"
          "6.ตีไข่ขาวกับ ครีม ออฟ ทาร์ทาร์ จนพอขึ้นฟู\n"
          "7.ใส่น้ำตาลทีละน้อย สลับกับตีด้วยความเร็วสูงจนกระทั่งใส่น้ำตาลหมด ตีต่อด้วยความเร็วสูงจนไข่ขาวตั้งยอดแข็ง และเนื้อเนียนละเอียด\n"
          "8.นำไข่ขาวที่ตีจนขึ้นฟูมาผสมลงกับส่วนผสมแป้งแพนเค้ก โดยแบ่งผสม 3 ครั้ง ตะล่อมเบา ๆ จนเนื้อแป้งแพนเค้กกับไข่ขาวเข้ากันดี\n"
          "9.นำกระทะขึ้นตั้งไฟปานกลาง ทาเนยบาง ๆ ให้ทั่ว วางพิมพ์กลมพร้อมกระดาษรองอบลงไป แล้วรอจนร้อน\n"
          "10. ตักแป้งแพนเค้กที่ผสมเข้ากันดีแล้วหยอดลงในกระทะ แล้วปรับเป็นไฟเบาทันที หยอดแป้งแพนเค้กซ้ำลงตรงกลางให้เป็นยอดสูง\n"
          "11.ปิดฝา รอจนแป้งเริ่มสุกแล้วจึงกลับด้านแพนเค้ก ทอดต่อจนหน้าแพนเค้กขึ้นสีแล้วจึงตักออกใส่จาน\n"
          "12.ตักไอศกรีมวางลงไป ตกแต่งด้วยท้อปปิ้ง ราดด้วยน้ำผึ้ง พร้อมเสิร์ฟ",
      image:"assets/images/25.png"
  ),
  Icecream(
      id : 26,
      name: "ฮันนี่โทสต์",
      iconImage:"assets/images/s26.png",
      type: "ไอศกรีม&ของหวาน",
      ingredient:
      "1.ขนมปังปอนด์ 1 แถวเล็ก\n"
          "2.เนยเค็มหั่นบาง ๆ 200 กรัม\n"
          "3.ไอศกรีม 1 ลูก (เลือกรสชาติได้ตามใจชอบ)\n"
          "4.วิปครีม สำหรับเสิร์ฟ\n"
          "5.น้ำผึ้ง สำหรับราด\n"
          "6.ท้อปปิ้งตามชอบ",
      description:
      "1.นำขนมปังปอนด์มาหั่นเป็นตาราง\n"
          "2.ใส่เนยลงไปตามช่องที่หั่นไว้ และบนหน้าขนมปังด้วย\n"
          "3.นำขนมปังไปเข้าไมโครเวฟประมาณ 2 นาที โดยใช้ความร้อน 800 วัตต์\n"
          "4.นำออกมาจัดเสิร์ฟกับท้อปปิ้ง ไอศกรีม และวิปครีม ราดด้วยน้ำผึ้ง จัดจานพร้อมเสิร์ฟ",
      image:"assets/images/26.png"
  ),
  Icecream(
      id : 27,
      name: "บิงซูผลไม้รวม",
      iconImage:"assets/images/s27.png",
      type: "ไอศกรีม&ของหวาน",
      ingredient:
      "1.นมสดรสจืด 1 ถ้วย\n"
          "2.ครีม 1 ถ้วย\n"
          "3.น้ำเชื่อม 1/4 ถ้วย\n"
          "4.ผงวานิลลา 30 กรัม\n"
          "5.สับปะรด,เมล่อน,แตงโม,แคนตาลูป หรือผลไม้ชนิดใดก็ได้ตามชอบ",
      description:
      "1.ผสมนมสด ครีม น้ำเชื่อม และผงวานิลลาเข้าด้วยกัน จากนั้นก็นำไปใส่ในถุงซิปล็อค\n"
          "2.นำนมไปแช่ประมาณ 5 ชั่วโมง หรือข้ามคืน\n"
          "3.หั่นผลไม้ให้พอดีคำตามต้องการ\n"
          "4.นำนมที่แช่แข็งออกมาทุบให้ละเอียด แล้วตักใส่ถ้วย\n"
          "5.ตกแต่งเอาผลไม้มาวางบนเกล็ดน้ำแข็ง พร้อมเสิร์ฟ",
      image:"assets/images/27.png"
  ),
  Icecream(
      id : 28,
      name: "นมเปรี้ยวบิงซู",
      iconImage:"assets/images/s28.png",
      type: "ไอศกรีม&ของหวาน",
      ingredient:
      "1.ขนมปังหั่นเป็นสี่เหลี่ยมชิ้นพอดีคำ\n"
          "2.นมเปรี้ยวรสผลไม้ที่ชอบ 1 กล่อง (ในที่นี้ใช้รสสตรอว์เบอร์รี)\n"
          "3.วิปปิ้งครีม\n"
          "4.ท้อปปิ้งต่าง ๆ ตามชอบ\n"
          "5.เครื่องปั่น\n"
          "6.พิมพ์ทำน้ำแข็ง\n"
          "7.แก้วไอศกรีมทรงสูง หรือแก้วน้ำทรงสูง",
      description:
      "1.นำนมเปรี้ยวเทลงไปในพิมพ์ทำน้ำแข็ง ใส่ช่องแช่แข็งทิ้งไว้จนจับตัวเป็นก้อน (ราว 4-5 ชั่วโมง หรือทิ้งไว้ข้ามคืน)\n"
          "2.นำขนมปังหั่นเป็นสี่เหลี่ยม ใส่แก้วไอศกรีมทรงสูง หรือแก้วที่เตรียมไว้\n"
          "3.นำนมเปรี้ยวที่แช่จนเป็นก้อนน้ำแข็งแล้ว มาปั่นในเครื่องปั่น เทลงไปด้านบนขนมปัง\n"
          "4.บีบวิปปิ้งครีมใส่ลงไป\n"
          "5.ตกแต่งหน้าด้วยท้อปปิ้งตามใจชอบ\n"
          "6.ราดซอสหรือนมเปรี้ยวรสที่ชอบ พร้อมเสิร์ฟ",
      image:"assets/images/28.png"
  ),
  Icecream(
      id : 29,
      name: "น้ำแข็งใสโบราณ",
      type: "ไอศกรีม&ของหวาน",
      iconImage:"assets/images/s29.png",
      ingredient:
      "1.น้ำแข็งทุบหรือป่น\n"
          "2.นมข้นหวาน\n"
          "3.นมสด\n"
          "4.น้ำผึ้ง\n"
          "5.ท้อปปิ้งตามชอบ",
      description:
      "1.น้ำแข็งใส่ลงไปในเครื่องปั่นน้ำผลไม้ ระหว่างปั่นใส่นมข้นลงไปหนึ่งในสามปั่นจนละเอียด จะได้น้ำแข็งปั่นคล้ายๆ เกล็ดหิมะ ตักใส่ถ้วยขนม\n"
          "2.จัดเรียงท้อปปิ้งตามชอบ วางลงบนน้ำแข็งปั่น\n"
          "3.ราดทับด้วยนมสด น้ำผึ้ง ตามชอบ อาจเพิ่มวิปครีมและไอศกรีมเข้าไปเพื่อเพิ่มสีสันให้น่าทานมากขึ้น",
      image:"assets/images/29.png"
  ),
];