class Bakery{
  final int id;
  final String name;
  final String iconImage;
  final String type;
  final String ingredient;
  final String description;
  final String image;

  Bakery({
    this.id,
    this.name,
    this.iconImage,
    this.type,
    this.ingredient,
    this.description,
    this.image,
  });
}
List<Bakery> bakery = [
  Bakery(
      id : 1,
      name: "แซนวิชผลไม้",
      iconImage:"assets/images/s01.png",
      type: "เบเกอรี่",
      ingredient:
      "1.ขนมปังแซนด์วิชตัดขอบ 4 แผ่น\n"
          "2.วิปปิ้งครีม 50 มิลลิลิตร\n"
          "3.โยเกิร์ตรสธรรมชาติ 50 กรัม\n"
          "4.น้ำตาลทราย 1 ช้อนโต๊ะ\n"
          "5.สตรอว์เบอร์รี หั่นเป็นชิ้น\n"
          "6.กีวี ปอกเปลือกหั่นเป็นชิ้น\n"
          "7.ลูกพีชในน้ำเชื่อม",
      description:
      "1.ใส่น้ำตาลทราย และโยเกิร์ตแช่เย็นลงในวิปปิ้งครีม ตีผสมจนขึ้นฟูเป็นเนื้อโฟม\n"
          "2.ปาดครีมลงบนขนมปังแซนด์วิชให้ทั่ว วางผลไม้ลงบนครีม ปาดทับด้วยครีม\n"
          "จากนั้นนำเข้าแช่เย็น ประมาณ 30 นาทีถึง 1 ชั่วโมงก่อนรับประทาน จากนั้นนำออกจากตู้เย็น"
          "ตัดเป็นชิ้น ๆ พร้อมเสิร์ฟ",
      image:"assets/images/01.png"
  ),
  Bakery(
      id : 2,
      name: "ขนมไข่",
      iconImage:"assets/images/s02.png",
      type: "เบเกอรี่",
      ingredient:
      "1.แป้งเค้ก 100 กรัม\n"
          "2.น้ำตาลทราย 100 กรัม\n"
          "3.ผงฟู ½ ช้อนชา\n"
          "4.ไข่ไก่เบอร์0 3 ฟอง\n"
          "5.กลิ่นวานิลลา ½ ช้อนชา\n"
          "6.น้ำมะนาว 1 ช้อนชา",
      description:
      "1.ตอกไข่ใส่ชามผสม แล้วตีด้วยตะกร้อจนไข่เริ่มขึ้นฟู แล้วทยอยใส่น้ำตาลลงไปขณะตีจนหมด\n"
          "2.ตีไข่จนตั้งยอดอ่อนจากนั้นใส่น้ำมะนาวลงไปแล้วคนให้เข้ากัน\n"
          "3.ร่อนแป้งกับผงฟูแล้วค่อย ๆ เทแป้งลงไปผสมกับไข่ ตะล่อมจนแป้งละลายหมด ใส่กลิ่นวานิลลาแล้วตะล่อมแป้งอีกครั้ง\n"
          "4.เทส่วนผสมแป้งลงในพิมพ์ที่จะใช้อบประมาณ ¾ ของพิมพ์หรืออย่าล้นพิมพ์ขึ้นมา\n"
          "5.วอร์มเตาอบใช้ไฟบน-ล่างและพัดลม อุณหภูมิ 180 องศาเซลเซียส แล้วนำขนมเข้าอบเป็นเวลา 15-20 นาทีจนขนมมีสีน้ำตาลและกรอบ",
      image:"assets/images/02.png"
  ),
  Bakery(
      id : 3,
      name: "โรลเค้ก",
      iconImage:"assets/images/s03.png",
      type: "เบเกอรี่",
      ingredient:
      "1.ไข่แดง 2 ฟอง\n"
          "2.น้ำตาล 23 กรัม\n"
          "3.น้ำมันรำข้าว 25 กรัม\n"
          "4.น้ำ 25 กรัม\n"
          "5.แป้งเค้ก 45 กรัม\n"
          "6.ไข่ขาว 2 ฟอง\n"
          "7.น้ำตาล 23 กรัม\n"
          "8.กลิ่นวานิลลา 1 ช้อนชา\n"
          "9.ครีมสด 200 กรัม\n"
          "10.นมข้นหวาน 25 กรัม\n"
          "11.แยมสตรอเบอรี่\n"
          "12.สตรอว์เบอร์รี่",
      description:
      "1.ผสมไข่แดง กลิ่นวานิลลา น้ำตาล น้ำมันรำข้าว และน้ำ คนให้เข้ากัน จากนั้นใส่แป้งเค้กลงไปคนให้เข้ากัน พักไว้\n"
          "2.ตีไข่ขาวกับน้ำตาล ทยอยใส่น้ำตาล ตีจนตั้งยอดอ่อนแล้วนำมาผสมกับไข่แดงที่เตรียมไว้ โดยแบ่งส่วนผสม 2 ครั้ง ครั้งแรกตะล่อมด้วยตะกร้อมือให้เข้ากัน อีกครึ่งที่เหลือใช้พายยางคนอย่างเบามือจนส่วนผสมเข้ากันดี\n"
          "3.เทส่วนผสมทั้งหมดลงในถาดอบ ปาดหน้าให้เรียบ นำเข้าเตาอบที่ 180 องศาเซลเซียส เป็นเวลา 10-15 นาที ไฟบนล่าง\n"
          "4.เมื่อแป้งสุกแล้ว นำแป้งออกจากพิมพ์ให้พักไว้ให้เย็น\n"
          "5.เตรียมตีครีมสด ผสมกับนมข้นหวาน ตีจนตั้งยอดแข็ง\n"
          "6.ปาดครีมสดและแยมสตรอเบอรี่ลงบนตัวแป้ง และม้วนให้เป็นโรลกลม นำเข้าตู้เย็น 10นาที\n"
          "7.นำโรลออกจากตู้เย็น แต่งหน้าด้วยครีมสด และสตรอว์เบอรี่",
      image:"assets/images/03.png"
  ),
  Bakery(
      id : 4,
      name: "เค้กชิฟฟ่อน",
      iconImage:"assets/images/s04.png",
      type: "เบเกอรี่",
      ingredient:
      "บัตเตอร์ครีม\n"
          "1.เนยสดชนิดเค็มพักไว้พอนุ่ม 560 กรัม\n"
          "2.เนยขาว 250 กรัม\n"
          "3.แบะแซ 1/4 ถ้วยตวง\n"
          "4.น้ำตาลทราย 300 กรัม\n"
          "5.น้ำเปล่า 80 กรัม\n"
          "6.เกลือป่นละเอียด 1 ช้อนชา\n"
          "7.ไข่ไก่ (เฉพาะไข่ขาว) 280 กรัม\n"
          "8.นมข้นหวาน 100 กรัม\n"
          "เค้กชิฟฟ่อนใบเตย\n"
          "1.แป้งเค้ก 275 กรัม\n"
          "2.แป้งข้าวโพด 15 กรัม\n"
          "3.ผงฟู 2 1/2 ช้อนชา\n"
          "4.น้ำตาลทราย 140 กรัม\n"
          "5.ไข่ไก่ (เฉพาะไข่แดง) 11 ฟอง\n"
          "6.น้ำเปล่า 80 กรัม\n"
          "7.น้ำใบเตย 100 กรัม\n"
          "8.กลิ่นวานิลลา 1 ช้อนโต๊ะ\n"
          "9.น้ำมันพืช 130 กรัม\n"
          "10.เกลือป่นละเอียด 1 ช้อนชา\n"
          "11.ไข่ไก่ (เฉพาะไข่ขาว) 12 ฟอง\n"
          "12.ครีมออฟทาร์ทาร์ 1 ช้อนชา\n"
          "13.น้ำตาลทราย (2) 220 กรัม\n"
          "14.สีผสมอาหารสีเขียว\n"
          "15.กระดาษสำหรับห่อเค้ก\n"
          "16.ถาดอบขนาด 11x15x2 นิ้ว จำนวน 2 ใบ",
      description:
      "บัตเตอร์ครีม\n"
          "1. ผสมน้ำตาลทราย แบะแซ น้ำเปล่า และเกลือป่น ยกขึ้นตั้งไฟ พอเดือด\n"
          "2. ตีไข่ขาวด้วยหัวตีตะกร้อโดยใช้ความเร็วสูงสุดของเครื่องจนขึ้นฟู\n"
          "3. ค่อย ๆ ใส่น้ำเชื่อมในข้อที่ 1 ขณะร้อน ๆ ลงไปเป็นสาย ตีต่อจนขึ้นฟูและเย็นสนิท\n"
          "4. ใส่เนยสดและเนยขาวตีพอเข้ากัน ใส่นมข้นหวานตีต่อจนมีลักษณะฟูและเนียนเป็นครีม\n"
          "เค้กชิฟฟ่อนใบเตย\n"
          "1. ทาถาดด้วยเนยขาว แล้วรองด้วยกระดาษไข ทาเนยขาวอีกครั้งจนทั่ว พักไว้\n"
          "2. ร่อนแป้งเค้ก แป้งข้าวโพด และผงฟูเข้าด้วยกันลงในอ่างผสม เตรียมไว้\n"
          "3. ผสมไข่แดง น้ำตาลทราย (1) น้ำเปล่า น้ำใบเตย กลิ่นวานิลลาน้ำมันพืช และเกลือป่น ผสมจนส่วนผสมละลายดี เทลงในส่วนผสมแป้งที่ร่อนไว้ คนด้วยตะกร้อมือจนเข้ากัน พักไว้\n"
          "4. ตีไข่ขาวกับครีมออฟทาร์ทาร์ด้วยหัวตีตะกร้อโดยใช้ความเร็วสูงสุดของเครื่องพอขึ้นฟู ค่อย ๆ เติมน้ำตาลทราย (2) ทีละน้อยจนหมด ตีต่อจนส่วนผสมตั้งยอดอ่อน นำไข่ขาวค่อย ๆ แบ่งลงผสมกับส่วนผสมในข้อที่ 3 จนหมด เติมสีเขียวตะล่อมเบา ๆ ด้วยตะกร้อมือและพายยางจนเข้ากันดี\n"
          "5. เทใส่ถาดอบที่เตรียมไว้เท่า ๆ กัน นำเข้าอบที่อุณหภูมิ 350 องศาฟาเรนไฮต์ ประมาณ 30-40 นาทีหรือจนสุก นำออกจากเตาอบแซะออกจากถาดพักขนมบนตะแกรงจนเย็นสนิท\n"
          "6. ปาดบัตเตอร์ครีมลงบนเนื้อเค้กจนทั่ว ประกบด้วยเค้กอีกชิ้นตัดเป็นชิ้นสามเหลี่ยม แล้วห่อด้วยกระดาษ",
      image:"assets/images/04.png"
  ),
  Bakery(
      id : 5,
      name: "บราวนี่",
      iconImage:"assets/images/s05.png",
      type: "เบเกอรี่",
      ingredient:
      "1.แป้งสาลีอเนกประสงค์ 90 กรัม\n"
          "2.ผงโกโก้ 30 กรัม\n"
          "3.ดาร์กช็อคโกแลต 64% 120 กรัม\n"
          "4.เนยสดรสเค็ม 120 กรัม\n"
          "5.ไข่ไก่ 2 ฟอง\n"
          "6.น้ำตาลทราย 160 กรัม\n"
          "7.เกลือป่น 1/2 ช้อนชา\n"
          "8.กลิ่นวานิลลา 2 ช้อนชา\n"
          "9.แอลม่อนสไลด์ 100 กรัม",
      description:
      "1.นำแป้งสาลีอเนกประสงค์ ผงโกโก้ ร่อนลงไปในชามผสมประมาณ 2 ครั้ง พักไว้\n"
          "2.นำดาร์กช็อกโกแลตและเนยสดไปละลาย คนให้เข้ากัน พักไว้\n"
          "3.จากนั้นนำเนยขาวลงไปทาในพิมพ์ ตามด้วยกระดาษไข และทาเนยขาวลงไปอีกครั้ง\n"
          "4.นำไข่ไก่สองฟอง น้ำตาลทราย คนผสมให้เข้ากัน เติมเกลือป่น และกลิ่นวานิลลา และคนผสมให้เข้ากันอีกครั้ง\n"
          "5.นำช็อกโกแลตที่ละลายไว้ลงไป คนให้เข้ากัน\n"
          "6.จากนั้นใส่แป้งที่ร่อนไว้ลงไป แบ่งใส่ประมาณ 2 ครั้ง คนผสมให้เข้ากัน\n"
          "7.จากนั้นนำอัลมอนต์สไลด์ใส่ลงไปในส่วนผสมบราวนี่ ตะล่อมให้เข้ากัน\n"
          "8.เทใส่แท่นพิมพ์ จากนั้นโรยด้วยอัลมอนต์สไลด์ไว้ด้านบน นำไปอบด้วยอุณหภูมิ 180 องศา ใช้เวลา 25-30 นาที",
      image:"assets/images/05.png"
  ),
  Bakery(
      id : 6,
      name: "เค้กวานิลลา",
      iconImage:"assets/images/s06.png",
      type: "เบเกอรี่",
      ingredient:
      "เนื้อเค้ก\n"
          "1.แป้งเค้ก155 กรัม\n"
          "2.แป้งสาลีอเนกประสงค์130 กรัม\n"
          "3.ผงฟู2 ช้อนชา\n"
          "4.เกลือ ½ ช้อนชา\n"
          "5.เนยจืด170 กรัม\n"
          "6.น้ำตาลทราย310 กรัม\n"
          "7.ไข่ไก่3 ฟอง\n"
          "8.นมข้นจืด180 มิลลิลิตร\n"
          "9.กลิ่นวานิลลา1 ช้อนโต๊ะ\n"
          "ครีม\n"
          "1.ไข่ขาว3 ฟอง\n"
          "2.ครีมออฟทาร์ทาร์¼ ช้อนชา\n"
          "3.น้ำตาลทราย180 กรัม\n"
          "4.น้ำสะอาด3 ช้อนโต๊ะ",
      description:
      "1.เปิดเตาอบที่ 170 องศาเซลเซียส โปรแกรมไฟล่าง-ไฟบน เตรียมพิมพ์อบขนาด 7 นิ้ว 3 ถาด ทาเนย และรองกระดาษไข\n"
          "2.ร่อนแป้งทั้งสองชนิด ผงฟู และเกลือ พักไว้"
          "3.ตีเนยให้นุ่มดี ใส่น้ำตาลทราย ตีต่อจนเข้ากันดี ใส่ไข่ไก่ลงไปทีละฟอง ตีให้เข้ากันก่อนใส่ฟองถัดไป ตามด้วยวานิลลา\n"
          "4.แบ่งส่วนผสมของแห้งเป็น 3 ส่วน และนมข้นจืด 2 ส่วน ใส่แป้งส่วนแรกลงไป ลดความเร็ว ตีจนส่วนผสมเข้ากัน ใส่นมส่วนแรกตามลงไป ตีให้พอเข้ากัน แล้วจึงใส่แป้งส่วนที่สอง นมส่วนที่สอง และแป้งส่วนสุดท้ายตามลำดับ\n"
          "5.แบ่งส่วนผสมเป็นสามส่วนเท่าๆ กัน ใส่ลงในพิมพ์ที่เตรียมไว้ อบเป็นเวลา 30 นาที พักให้เย็นลง นำออกจากพิมพ์\n"
          "6.ทำครีม โดยนำน้ำตาลทราย และน้ำไปตั้งไฟ เคี่ยวให้น้ำเชื่อมข้นมีลักษณะเหมือนยางมะตูม หรือมีอุณหภูมิอยู่ที่ 118-121 องศาเซลเซียส\n"
          "7.ระหว่างต้มน้ำเชื่อม ตีไข่ขาวกับครีมออฟทาร์ทาร์ ด้วยหัวตีตะกร้อ ตีจนส่วนผสมตั้งยอดอ่อน ค่อยๆ เทน้ำเชื่อมลงไปเป็นสายจนหมด เร่งความเร็ว ตีต่อจนส่วนผสมเนื้อแน่นและมีลักษณะที่เงาดี\n"
          "8.ปาดครีมลงบนเค้กทั้งสามชั้น และปาดด้านข้าง พร้อมรับประทาน",
      image:"assets/images/06.png"
  ),
  Bakery(
      id : 7,
      name: "พายสัปปะรด",
      iconImage:"assets/images/s07.png",
      type: "เบเกอรี่",
      ingredient:
      "สับปะรดกวน\n"
          "1.เนื้อสับปะรดสับละเอียด 500 กรัม (ใช้สับปะรดสด หรือสับปะรดกระป๋องก็ได้)\n"
          "2.น้ำตาลทราย 90 กรัม\n"
          "4.เกลือป่น 1/4 ช้อนชา\n"
          "5.เนยสด 1/2 ช้อนโต๊ะ (ไม่ใส่ก็ได้)\n"
          "แป้งพาย\n"
          "1.แป้งสาลีอเนกประสงค์ 115 กรัม\n"
          "2.ผงฟู 1/8 ช้อนชา\n"
          "3.เบกกิ้งโซดา 1/8 ช้อนชา\n"
          "4.นมผง 3 ช้อนโต๊ะ\n"
          "5.เกลือป่น 1/8 ช้อนชา\n"
          "6.เนยสดหั่นชิ้นเล็ก ๆ 85 กรัม\n"
          "7.เนยขาว 25 กรัม\n"
          "8.ไข่แดง 1 ฟอง\n"
          "9.น้ำตาลวานิลลา 1/2 ช้อนชา\n"
          "10.น้ำตาลไอซิ่ง 20-25 กรัม\n"
          "11.ไข่แดง (สำหรับทาหน้าพาย)",
      description:
      "1.ทำไส้สับปะรดกวนโดยใส่สับปะรดสับลงในหม้อ ใช้ไฟกลาง เติมน้ำตาลทรายกับเกลือป่นลงไป กวนให้เข้ากันจนสับปะรดเหนียวเป็นก้อน ปิดไฟใส่เนยสดลงไป กวนให้เข้ากัน ยกลงจากเตา\n"
          "2.ทำแป้งพายโดยนำส่วนผสมทุกอย่างใส่ลงในเครื่องปั่นอาหาร ปั่นจนละเอียดเข้ากัน นำออกมาห่อด้วยพลาสติกถนอมอาหาร เสร็จแล้วนำเข้าตู้เย็นประมาณ 30 นาที พอครบเวลานำแป้งออกมารีดเป็นแผ่น ความหนาประมาณ 1/4 นิ้ว\n"
          "3.ทำแป้งพายเป็นรูปกังหันโดยวางไส้สับปะรดกวนลงไปตรงกึ่งกลาง ตัดมุมทั้ง 4 เข้าหาไส้สับปะรด จากนั้นยกมุมแป้งขึ้นไปปิดไส้สับปะรดให้เรียงกันเป็นรูปกังหัน หรือจะห่อด้วยการพับมุม 2 มุมทบลงมาตรงกึ่งกลางไส้สับปะรดกวนก็ได้ นำมาวางเรียงลงบนถาดที่ปูกระดาษรองอบไว้แล้ว ทาไข่แดงบนแป้งพายให้ทั่ว\n"
          "4.นำเข้าอบที่อุณหภูมิ 170 องศาเซลเซียส ประมาณ 15 นาทีหรือจนแป้งพายสุกสีเหลืองสวย นำออกจากเตาอบ พักไว้บนตะแกรงให้เย็น พร้อมเสิร์ฟ",
      image:"assets/images/07.png"
  ),
  Bakery(
      id : 8,
      name: "ครัวซองต์",
      iconImage:"assets/images/s08.png",
      type: "เบเกอรี่",
      ingredient:
      "1.แป้งขนมปัง 500 กรัม\n"
          "2.ยีสต์ 10 กรัม\n"
          "3.นมสด 1 ถ้วย\n"
          "4.น้ำตาล ¼ ถ้วย\n"
          "5.เกลือ 7 กรัม\n"
          "6.เนยสดจืด 250 กรัม",
      description:
      "1.ผสมแป้ง โดยการเทนม แป้งขนมปัง ยีสต์ และ น้ำตาล แล้วนวดให้เข้ากัน ทิ้งไว้ประมาณ 5 นาที\n"
          "2.เอาพลาสติกใสห่อแป้ง แล้วนำแป้งไปแช่ในตู้เย็นประมาณ 1 ชั่วโมง\n"
          "3.ทำเนย โดยการตัดกระดาษไข แล้วรีดเนยให้ขนาดเท่า A5 เอาไปแช่เย็น\n"
          "4.เอาเนยให้เข้าไปอยู่ในตัวแป้ง โดยอย่างแรกให้รีดแป้งให้มีขนาดเท่าขนาด A4\n"
          "5.นำเนยวางไว้ตรงกลางของแป้ง แล้วลอกเนยออกจากกระดาษไขออก แล้วพับแป้งเข้าไปให้หุ้มเนย\n"
          "6.ห่อด้วยพลาสติกใส นำไปแช่เย็น 30 นาที\n"
          "7.รีดให้ยาว 45 เซนติเมตร กว้าง 20 พับครึ่งของแป้ง แล้วทบอีกฝั่ง จากนั้นห่อพลาสติกใส แช่เย็นอีก 30 นาที\n"
          "8.รีดแป้งอีกหนึ่งครั้งให้ยาว 50 เซนติเมตร กว้าง 20 เซนติเมตร แล้วพับสองด้านของแป้งชิดเข้าหากัน และพับเข้าหากัน จากนั้นห่อพลาสติกใส แช่เย็นอีก 30 นาที\n"
          "9.ขึ้นรูปครัวซองต์ ให้ยาว 50 เซนติเมตร กว้าง 20 เซนติเมตร ให้มีความหนาประมาณ 3 มิลลิเมตร\n"
          "10.ตัดแป้งประมาณ 4 นิ้ว โดยการตัดมุมเฉียง ให้เหมือนชิ้นพิซซ่า แล้วขึ้นรูปครัวซองต์ โดยการม้วนตรงด้านเส้นตรงเข้าหามุมแหลม นำเอาครัวซองต์ไปใส่ถาดอบ\n"
          "11.ตีไข่ไก่และนมสดลงไป แล้วกรองเอาไข่ขาวออก ทาไข่ลงบนแป้งครัวซอง\n"
          "12.นำเอาแป้งครัวซองต์ไปอบ 190 องศา ประมาณ 20 นาที พร้อมเสิร์ฟ",
      image:"assets/images/08.png"
  ),
  Bakery(
      id : 9,
      name: "คุกกี้",
      iconImage:"assets/images/s09.png",
      type: "เบเกอรี่",
      ingredient:
      "1.น้ำตาลทรายแดง 100 กรัม\n"
          "2.น้ำตาลมะพร้าว 50 กรัม\n"
          "3.เกลือ 5 กรัม\n"
          "4.เบกกิ้งโซดา 2 กรัม\n"
          "5.ช็อกโกแลตชิพ 75 กรัม\n"
          "6.เนย 100 กรัม\n"
          "7.ไข่ไก่ 1 ฟอง\n"
          "8.แป้งสาลีอเนกประสงค์ 200 กรัม",
      description:
      "1.ตีเนยในชาม\n"
          "2.ค่อยๆ ใส่ น้ำตาลทรายแดง และน้ำตาลมะพร้าว ใช้เครื่องตีความเร็วปานกลาง เมื่อเข้ากันดีแล้ว ให้ใส่ไข่ ต่อจากนั้นใส่ของแห้ง แป้งสาลีอเนกประสงค์ เบกกิ้งโซดา และเกลือ เมื่อเข้ากันแล้ว ใส่ช็อกโกแลตชิพลงไป เปิดเครื่องตีเบาๆ\n"
          "3. ใช้สคูปไอศกรีมตักเป็นลูก ลูกละประมาณ 25 กรัมต่อชิ้น\n"
          "4. นำไปอบในอุณหภูมิ 180 องศาเซลเซียส เป็นเวลา 6 นาที พร้อมเสิร์ฟ",
      image:"assets/images/09.png"
  ),
  Bakery(
      id : 10,
      name: "ทาร์ตไข่",
      iconImage:"assets/images/s10.png",
      type: "เบเกอรี่",
      ingredient:
      "1.แป้งพายถ้วย 12 ถ้วย\n"
          "2.ไข่ไก่ 2 ฟอง\n"
          "3.ไข่แดง 2 ฟอง\n"
          "4.นมสด 250 กรัม\n"
          "5.น้ำตาลทราย 70 กรัม\n"
          "6.วนิลา 1/2 ช้อนชา\n"
          "7.เนยสด 20 กรัม",
      description:
      "1.ตั้งกระทะ ใส่นมสด พอเดือด ใส่น้ำตาลทราย เนยเค็ม กลิ่นวนิลา คนพอเข้ากันปิดไฟ พักไว้\n"
          "2.ตอกไข่ใส่ชามผสม ไข่ทั้งใบ 2 ฟอง ไข่แดงอีก 2 ฟอง คนไข่ให้เนียนเข้ากันดีค่อยๆ ใส่นมที่ต้มลงไป ใส่ทีละน้อยๆ แล้วคนให้เข้ากัน อย่าใส่ครั้งเดียวหมดไข่ไก่จะสุก ทำแบบนี้จนเสร็จเลย แล้วเอาไปกรองด้วยตะแกรงตาถี่ พักไว้ก่อน\n"
          "3.เตรียมถาดสำหรับอบ วางถ้วยแป้งพาย แล้วค่อยๆ หยอดไข่ใส่พิมพ์ ให้เต็มพอดี เอาเข้าเตาอบ\n"
          "4.วอร์มเตาอบ 150 องศา ประมาณ 20 นาทีก่อน จากนั้นเอาขนมเข้าอบ ไฟบน-ล่าง ประมาณ 30-40 นาที หรือจนกว่าจะได้หน้าขนมที่เหลืองสวยตามต้องการ พออบสุกแล้วก็จัดใส่จาน พร้อมเสิร์ฟ",
      image:"assets/images/10.png"
  ),
];