class ThaiDessert{
  final int id;
  final String name;
  final String iconImage;
  final String type;
  final String ingredient;
  final String description;
  final String image;

  ThaiDessert({
    this.id,
    this.name,
    this.iconImage,
    this.type,
    this.ingredient,
    this.description,
    this.image,
  });
}
List<ThaiDessert> thaidessert = [
  ThaiDessert(
      id : 11,
      name: "กล้วยบวชชี",
      iconImage:"assets/images/s11.png",
      type: "ขนมไทย",
      ingredient:
      "1.กล้วยน้ำว้า 8 ลูก (เลือกห่าม ๆ ไม่สุกมาก)\n"
          "2.หัวกะทิ 225 มิลลิลิตร\n"
          "3.หางกะทิ 300 มิลลิลิตร\n"
          "4.ใบเตย 2 ใบ\n"
          "5.น้ำตาลปี๊บ 30 กรัม\n"
          "6.น้ำตาลทรายขาว 20 กรัม\n"
          "7.เกลือ ¼ ช้อนชา\n"
          "8.แป้งมัน 1 ช้อนชา",
      description:
      "1นำกล้วยทั้งเปลือกไปนึ่งในน้ำเดือด ประมาณ 3 - 5 นาที แล้วปิดไฟ\n"
          "2.ปอกเปลือกและหั่นกล้วยเป็นชิ้นเล็ก ๆ\n"
          "3.ตั้งหม้อไฟกลาง ใส่หางกะทิและใบเตยลงไป ต้มจนเดือด\n"
          "4.ใส่น้ำตาลปี๊บ น้ำตาลทรายขาว และเกลือลงไป คนให้ละลาย\n"
          "5.ใส่กล้วยที่หั่นไว้ลงไป ต้มให้เดือดอีกครั้ง\n"
          "6.ใส่หัวกะทิลงไป และปล่อยทิ้งไว้ให้เดือดอีกประมาณ 3 นาที พร้อมเสิร์ฟ",
      image:"assets/images/11.png"
  ),
  ThaiDessert(
      id : 12,
      name: "ขนมใส่ไส้",
      iconImage:"assets/images/s12.png",
      type: "ขนมไทย",
      ingredient:
      "1.มะพร้าวขูดขาว 2+1/2 ถ้วย\n"
          "2.น้ำตาลมะพร้าว 1+1/2 ถ้วย\n"
          "3.น้ำต้มสุก\n"
          "4.เทียนสำหรับอบควันเทียน (ใช้หรือไม่ใช่ก็ได้ตามความสะดวก)\n"
          "5.แป้งข้าวเหนียว 2 ถ้วย\n"
          "6.น้ำเย็น 1/3 ถ้วย (หรือน้ำใบเตย, น้ำอัญชันแช่เย็น หากต้องการเพิ่มสีสัน)\n"
          "7.แป้งข้าวเจ้า 1/3 ถ้วย\n"
          "8.เกลือป่น 2 ช้อนชา\n"
          "9.หัวกะทิ 3+1/3 ถ้วย\n"
          "10.ใบตอง/ ใบมะพร้าว\n"
          "11.ไม้กลัด",
      description:
      "เตรียมใบตอง\n"
          "1.ตัดใบตองเป็น 2 ขนาด แผ่นใหญ่ขนาดประมาณ 5X9 เซนติเมตร และแผ่นเล็กขนาดประมาณ 4X6 เซนติเมตร\n"
          "2.ตัดหัว-ท้ายเป็นสามเหลี่ยม เช็ดให้สะอาดทั้ง 2 ด้าน นำไปตากแดดทิ้งไว้สักครู่ (เพื่อไม่ให้ใบตองแตกขณะห่อขนม)\n"
          "ส่วนผสมไส้ขนม\n"
          "1.กวนมะพร้าวขูดกับน้ำตาลมะพร้าว และน้ำต้มสุกในกระทะด้วยไฟอ่อน ๆ จนส่วนผสมเหนียวและแห้ง ยกลงจากเตา พักทิ้งไว้จนเย็นสนิท\n"
          "2.พอส่วนผสมเย็นสนิทแล้วปั้นเป็นก้อนกลม ๆ ประมาณ 1 นิ้วใส่ในภาชนะที่มีฝาปิด\n"
          "3.นำส่วนผสมไส้ไปอบด้วยควันเทียน เตรียมไว้\n"
          "ทำแป้ง\n"
          " นวดแป้งข้าวเหนียวกับน้ำเย็นจนพอปั้นได้ จากนั้นปั้นเป็นก้อนกลมขนาดเดียวกับหน้าไส้ที่เตรียมไว้\n"
          "ผสมหน้าขนม\n"
          " ผสมแป้งข้าวเจ้า เกลือป่น และกะทิคนให้ละลายเข้าด้วยกัน เทใส่ในกระทะทองเหลือง (หรือกระทะเทฟลอน) ใช้ไฟปานกลางกวนจนข้นและเดือดทั่ว ยกลงจากเตา เตรียมไว้\n"
          "ทำขนมใส่ไส้แบบห่อใบตอง\n"
          "1.แผ่แป้งข้าวเหนียวที่ปั้นไว้เป็นแผ่นบาง ๆ (พอหุ้มไส้ได้มิด) จากนั้นหยิบไส้ขนมวางลงไปตรงกลางแล้วหุ้มแป้งให้มิด วางขนมลงบนใบตองที่ซ้อนกัน\n"
          "2.หงายใบตองแผ่นใหญ่ขึ้น (ด้านนวล) แล้ววางทับด้วยใบตองแผ่นเล็ก วางไส้ขนมลงไป จากนั้นตักหน้าขนมประมาณ 1/2 ช้อนชา ใส่ด้านบนไส้\n"
          "3.ห่อใบตองเป็นทรงสูง ใช้ใบมะพร้าวที่เตรียมไว้คาดและกลัดด้วยไม้กลัดให้เรียบร้อย ตัดปลายเตี่ยวให้เฉียงและยาวพองาม วางเรียงห่อขนมลงในชุดนึ่ง\n"
          "4.นำขนมไปนึ่งในชุดนึ่งที่มีน้ำเดือดพล่านประมาณ 10 นาที ยกลงจากเตา",
      image:"assets/images/12.png"
  ),
  ThaiDessert(
      id : 13,
      name: "ข้าวต้มมัด",
      iconImage:"assets/images/s13.png",
      type: "ขนมไทย",
      ingredient:
      "1.ข้าวเหนียวเขี้ยวงู (ข้าวเก่า) 1 กิโลกรัม\n"
          "2.หัวกะทิ ปนหางกะทินิดหน่อย 1 กิโลกรัม\n"
          "3.น้ำตาลทรายขาว 3 ขีดครึ่ง\n"
          "4.เกลือ 1 ช้อนโต๊ะพูนๆ\n"
          "5.น้ำมันพืช 3 ช้อนโต๊ะ\n"
          "6.กล้วยน้ำว้าค่อนข้างสุก ประมาณ 1 หวี\n"
          "7.ั่วดำ ครึ่งกิโลกรัม (แช่น้ำทิ้งไว้ 1 คืน)\n"
          "8.ใบเตย 1 กำมือ\n"
          "9.ใบตองกล้วยน้ำว้า เช็ดให้สะอาด\n"
          "10.ตอกมัดข้าวต้ม",
      description:
      "1.ซาวข้าวเหนียวด้วยสารส้ม 3 น้ำ ล้างให้ดี แล้วแช่น้ำพักไว้\n"
          "2.ตั้งกระทะเปิดไฟ เอากะทิลงเคี่ยว ใส่ใบเตย ใช้ไฟปานกลาง เคี่ยวไปเรื่อยๆ เอาให้เดือดสักพักใหญ่ แล้วใส่เกลือ\n"
          "3.หันไปซาวข้าวเหนียวขึ้น แล้วใส่หวด (ที่นึ่งข้าวเหนียว) สะเด็ดน้ำให้แห้ง\n"
          "4.ข้าวสะเด็ดน้ำแล้ว นำไปเทลงไปผัดกับกะทะที่เคี่ยวไว้ก่อนหน้านี้ เปิดไฟปานกลาง กวนไปจนกว่าจะแห้ง\n"
          "5.ใส่น้ำมันพืชลงไปเพื่อไม่ให้ข้าวติดกะทิ\n"
          "6.ใส่น้ำตาลทราย กวนต่อจนกว่าจะแห้ง\n"
          "7.จากนั้นปิดไฟ พักไว้\n"
          "8.ล้างถั่วดำที่แช่ค้างคืนให้สะอาด จากนั้นนำไปต้ม ไฟปานกลาง พอเดือดแล้วหรี่ไฟ ต้มไปเรื่อยๆ ต้มให้เปื่อย บี้ถั่วดูว่าเปื่อยหรือยัง\n"
          "9.หลังจากนั้น ยกขึ้นกรองน้ำออกให้ถั่วสะเด็ดน้ำ\n"
          "10.เอาตอกไปฉีกครึ่ง (ก่อนมัดนำไปแช่น้ำประมาณ 15 นาทีเพื่อให้ตอกนิ่มมัดง่าย)\n"
          "11.กล้วยนำไปผ่าครึ่ง\n"
          "12.จากนั้นลงมือห่อแล้วนำไปนึ่งทิ้งไว้ 2 ชม.\n"
          "13.นำออกจากซึ้งนึ่งเอาข้าวต้มมัดออกมาผึ่งใส่กระจาดเพื่อไม่ให้ข้าวแฉะ พร้อมเสิร์ฟ",
      image:"assets/images/13.png"
  ),
  ThaiDessert(
      id : 14,
      name: "ขนมมันม่วง",
      iconImage:"assets/images/s14.png",
      type: "ขนมไทย",
      ingredient:
      "1.มันม่วงนึ่ง250 กรัม\n"
          "2.แป้งมัน15 กรัม\n"
          "3.กะทิ250 กรัม\n"
          "4.แป้งข้าวจ้าว100 กรัม\n"
          "5.น้ำตาลทราย120 กรัม\n"
          "6.เกลือป่น1/2 ช้อนชา\n"
          "7.มะพร้าวขูด",
      description:
      "1.ผสมแป้งข้าวจ้าว แป้งมัน น้ำตาลทราย เกลือ ลงในกะละมัง เทน้ำกะทิลงไปทีละน้อยจนหมด ใส่มันม่วงนึ่งสุกลงไป ขยำจะเป็นเนื้อเดียวกัน\n"
          "2.หมักส่วนผสมข้อที่ 1 ไว้ประมาณ 10 นาที จากนั้นตักหยอดลงในกระทงใบตองที่ทำไว้\n"
          "3.นึ่งขนมด้วยไฟกลางประมาณ 20 นาทีและยกลง โรยหน้าด้วยมะพร้าวขูด",
      image:"assets/images/14.png"
  ),
  ThaiDessert(
      id : 15,
      name: "ฝอยทอง",
      iconImage:"assets/images/s15.png",
      type: "ขนมไทย",
      ingredient:
      "1.ไข่เป็ด 6 ฟอง\n"
          "2.ไข่ไก่ 3 ฟอง\n"
          "3.น้ำตาลทรายขาว 1 กิโลกรัม\n"
          "4.น้ำลอยดอกมะลิ 1,000 มิลลิลิตร\n"
          "5.ใบเตย (มัดรวมกัน) 4 ใบ\n"
          "6.กรวยใบตองหรือกรวยโลหะ\n"
          "7.ไม้แหลม ยาวประมาณ 1 ฟุต",
      description:
      "1.แยกไข่แดงกับไข่ขาวออกจากกันและรีดไข่น้ำค้าง (ไข่ขาวที่เป็นน้ำใส ๆ เหมือนน้ำค้างติดอยู่ภายในเปลือกไข่) ลงไปในไข่แดง (ไข่น้ำค้างทำให้เส้นฝอยทองเหนียวนุ่ม ไม่ขาดง่าย) ตีผสมไข่แดงให้พอเป็นเนื้อเดียวกัน (ไม่ต้องตีให้ขึ้นฟู เพราะจะทำให้เส้นขาดเวลาโรยลงในกระทะ) จากนั้นนำไปกรองในผ้าขาวบาง เตรียมไว้\n"
          "2.ทำน้ำเชื่อมโดยใส่น้ำลอยดอกมะลิ น้ำตาลทราย และใบเตยลงในหม้อ นำขึ้นตั้งไฟกลางรอจนน้ำตาลละลาย จากนั้นนำไปกรองแล้วเทใส่ลงกระทะทองเหลือง เคี่ยวด้วยไฟอ่อนอีกครั้งจนเป็นเหนียวข้น\n"
          "3.ตักส่วนผสมไข่แดงลงในกรวยแล้วค่อย ๆ โรยไข่แดงลงไปในน้ำเชื่อมที่เดือด (ใช้ไฟกลาง) วนให้รอบกระทะทองเหลืองประมาณ 20-30 รอบต่อชิ้น จากนั้นยกกรวยขึ้น\n"
          "4.พอไข่แดงสุกให้ใช้ไม้ปลายแหลมพับครึ่งเส้นฝอยทองแล้วเอามาพักบนตะแกรงให้สะเด็ดน้ำเชื่อม พร้อมเสิร์ฟ",
      image:"assets/images/15.png"
  ),
  ThaiDessert(
      id : 16,
      name: "ลูกชุบ",
      iconImage:"assets/images/s16.png",
      type: "ขนมไทย",
      ingredient:
      "ถั่วกวน\n"
          "1.ถั่วเขียวเลาะเปลือก (ถั่วทอง) 300 กรัม\n"
          "2.หัวกะทิ 250 กรัม\n"
          "3.น้ำตาลทราย 180 กรัม\n"
          "4.สีผสมอาหาร\n"
          "5.ไม้ปลายแหลม\n"
          "วุ้นสำหรับชุบ\n"
          "6.ผงวุ้น 15 กรัม\n"
          "7.น้ำเปล่า 900 กรัม\n"
          "8.น้ำตาลทราย 100 กรัม\n",
      description:
      "1.ถั่วเขียวเลาะเปลือกล้างให้สะอาด แช่น้ำไว้ข้ามคืน จากนั้นนำมานึ่งหรือหุงให้สุกนุ่ม ใส่ถั่วที่สุกแล้ว น้ำตาลทราย หัวกะทิ ลงในโถปั่นน้ำผลไม้ ปั่นให้ละเอียด\n"
          "2.เทใส่กระทะ ยกขึ้นตั้งไฟกวนจนแห้งล่อนจากกระทะ ยกลงพักไว้ให้เย็น\n"
          "3.ปั้นถั่วเป็นก้อนกลม ใช้ไม้ปลายแหลมช่วยในการขึ้นรูปต่าง ๆ ตามชอบ\n"
          "4.ระบายสีโดยใช้พู่กัน หรือชุบด้วยวิธีจุ่มลงในถ้วยที่ผสมสีไว้ พักไว้ให้สีแห้ง\n"
          "5.ทำวุ้นโดยผสมผงวุ้นกับน้ำเปล่าคนให้เข้ากัน ยกขึ้นตั้งไฟให้เดือดและวุ้นละลายดี ใส่น้ำตาล พอเดือดอีกครั้งยกลงจากเตา กรองด้วยกระชอน\n"
          "6.นำถั่วที่ปั้นไว้ลงชุบในน้ำวุ้น เสียบลงบนแผ่นโฟม พักไว้ให้เย็น ชุบประมาณ 3 รอบหรือจนลูกชุบขึ้นเงาสวย\n"
          "7.ดึงลูกชุบออกจากไม้ปลายแหลม ตัดวุ้นส่วนเกินออก จัดจาน พร้อมเสิร์ฟ",
      image:"assets/images/16.png"
  ),
  ThaiDessert(
      id : 17,
      name: "ขนมชั้น",
      iconImage:"assets/images/s17.png",
      type: "ขนมไทย",
      ingredient:
      "1.แป้งข้าวเจ้า 40 กรัม\n"
          "2.แป้งท้าวยายม่อม 40 กรัม\n"
          "3.แป้งมัน 300 กรัม\n"
          "4.กะทิ 500 มิลลิลิตร\n"
          "5.น้ำตาลทราย 500 กรัม\n"
          "6.ใบเตย 3-4 ใบ\n"
          "7.กลิ่นมะลิ 1/2 ช้อนชา\n"
          "8.น้ำใบเตย 1/4 ถ้วย",
      description:
      "1.ผสมน้ำตาลทรายกับกะทิ แล้วนำไปตั้งไฟอ่อนๆ พอให้อุ่นจนน้ำตาลทรายเริ่มละลาย ไม่ต้องต้มให้เดือด เสร็จแล้ววางพักไว้\n"
          "2.ผสมแป้งทั้งสามอย่างเข้าด้วยกัน แล้วค่อยๆ เติมน้ำกะทิลงไป คนจนแป้งละลาย หากไม่แน่ใจว่าแป้งละลายหมด ให้นำไปกรองกับกระชอนตาถี่\n"
          "3.แบ่งน้ำกะทิไว้สองชาม ชามแรกผสมกลิ่นมะลิลงไป คนให้เข้ากัน อีกหนึ่งชามใส่น้ำใบเตยลงไป คนให้เข้ากัน\n"
          "4.เตรียมพิมพ์สำหรับขนมชั้น ใส่น้ำในลังถึง ต้มน้ำจนเดือด แล้วนำแม่พิมพ์ลงไปนึ่งวอร์มก่อน 15 นาที\n"
          "5.เสร็จแล้วก็เทขนมลงไปทีละชั้น ชั้นละเท่าๆ กัน ระหว่างสลับสีกันให้นึ่งชั้นละ 5 นาที จนเต็มแม่พิมพ์\n"
          "6.นึ่งเสร็จแล้ว นำขนมออกมาหั่นเป็นชิ้นสี่เหลี่ยม จัดเรียงใส่จาน พร้อมเสิร์ฟ",
      image:"assets/images/17.png"
  ),
  ThaiDessert(
      id : 18,
      name: "วุ้นกะทิอัญชัน",
      iconImage:"assets/images/s18.png",
      type: "ขนมไทย",
      ingredient:
      "วุ้นอัญชัน\n"
          "1.น้ำเปล่า 2 ถ้วย (ถ้าต้องการความหอมให้ผสมกลิ่นมะลิ 1 ช้อนชา)\n"
          "2.ผงวุ้น 1 ช้อนโต๊ะ + 2 ช้อนชา\n"
          "3.น้ำอัญชันคั้นเข้มข้น 1/2 ถ้วย\n"
          "4.น้ำตาลทราย 3/4 ถ้วย ถึง 1 ถ้วย\n"
          "วุ้นกะทิ\n"
          "1.กะทิ 2+1/2 ถ้วย\n"
          "2.ผงวุ้น 1 ช้อนโต๊ะ + 2 ช้อนชา\n"
          "3.น้ำตาลทราย 1/2 ถ้วย\n"
          "4.เกลือป่น ปลายช้อนชา",
      description:
      "1.ใส่น้ำและผงวุ้นลงในหม้อ คนให้ผงวุ้นกระจายทั่ว ๆ และไม่เป็นก้อน พักทิ้งไว้สักครู่\n"
          "2.นำส่วนผสมขึ้นตั้งไฟกลางอ่อน คนผสมเรื่อย ๆ จนเริ่มเดือดและผงวุ้นละลายหมด จากนั้นเติมน้ำตาลทรายลงไป คนให้น้ำตาลทรายละลาย\n"
          "3.ใส่น้ำอัญชันคั้นเข้มข้นลงไป คนผสมให้เข้ากัน รอจนเดือดอีกครั้ง ปิดไฟ ยกลงจากเตาแล้วนำส่วนผสมไปกรอง\n"
          "4.เทส่วนผสมวุ้นอัญชันใส่ลงพิมพ์ที่เตรียมไว้ประมาณครึ่งพิมพ์ นำไปแช่เย็นจนเซตตัว เตรียมไว้\n"
          "5.ใส่กะทิลงในหม้อ ตามด้วยผงวุ้น จากนั้นคนให้ผงวุ้นกระจายทั่ว ๆ\n"
          "6.นำขึ้นตั้งไฟกลางค่อนข้างอ่อน คนจนผงวุ้นละลาย และกะทิเริ่มเดือด (แต่ไม่ต้องแตกมัน) จากนั้นเติมน้ำตาลทรายและเกลือลงไป คนให้ละลาย ปิดไฟ ยกลงจากเตา\n"
          "7.ตักส่วนผสมวุ้นกะทิหยอดลงในพิมพ์ทับวุ้นอัญชันจนเต็มพิมพ์ นำไปแช่เย็นจนเซตตัว นำออกจากพิมพ์ พร้อมเสิร์ฟ",
      image:"assets/images/18.png"
  ),
  ThaiDessert(
      id : 19,
      name: "บัวลอยไข่หวาน",
      iconImage:"assets/images/s19.png",
      type: "ขนมไทย",
      ingredient:
      "แป้งบัวลอย\n"
          "1.แป้งข้าวเหนียว 100 กรัม\n"
          "2.แป้งมัน 10 กรัม\n"
          "3.สีผสมอาหาร อย่างละ 4 หยด (สีม่วง / สีฟ้า/ สีเขียว / สีเหลือง / สีแดง)\n"
          "4.น้ำดื่ม\n"
          "น้ำกะทิ\n"
          "1.กะทิ 4 ถ้วย (หางกะทิ 2 ถ้วย + หัวกะทิ 2 ถ้วย)\n"
          "2.น้ำตาลปี๊บ 100 กรัม\n"
          "3.น้ำตาลทราย 80 กรัม\n"
          "4.เกลือป่น 1/4 ช้อนโต๊ะ\n"
          "5.มะพร้าวอ่อนหั่นชิ้นพอคำ 50 กรัม\n"
          "6.ไข่ไก่ 2 ฟอง (ใส่เพิ่มได้ตามต้องการ)",
      description:
      "1.ใส่แป้งข้าวเหนียว แป้งมัน และสีผสมอาหารลงในชาม ค่อย ๆ ใส่น้ำลงพร้อมกับนวดให้แป้งเป็นเนื้อเดียวกัน\n"
          "2.ทำแป้งให้ครบทุกสี แล้วคลุมพลาสติกแรปพักไว้\n"
          "3.นำแป้งมาปั้นเป็นก้อนกลมเล็ก ๆ  แล้วนำไปต้มในน้ำเดือด พอแป้งลอยขึ้นมา ให้ตักขึ้นพักไว้ในน้ำเย็น\n"
          "4.นำหม้อขึ้นตั้งเตา ใส่หางกะทิ น้ำตาลปี๊บ น้ำตาลทราย และเกลือ คนให้ส่วนผสมเข้ากัน\n"
          "5.ตอกไข่ลงในน้ำกะทิทีละฟอง เมื่อไข่สุกตักขึ้นพักไว้\n"
          "6.เติมหัวกะทิลงไป คนให้ส่วนผสมเข้ากัน ใส่แป้งบัวลอย และมะพร้าวอ่อนลงไป แล้วต้มอย่างน้อย 10 นาที ตักใส่ถ้วย เสิร์ฟพร้อมไข่หวาน",
      image:"assets/images/19.png"
  ),
  ThaiDessert(
      id : 20,
      name: "เม็ดขนุน",
      iconImage:"assets/images/s20.png",
      type: "ขนมไทย",
      ingredient:
      "1.ถั่วเขียวเลาะเปลือกนึ่งและบด 250 กรัม\n"
          "2.น้ำตาลทราย 80 กรัม (สำหรับทำไส้ถั่ว)\n"
          "3.กะทิ 150 มิลลิลิตร\n"
          "4.ไข่แดงของไข่เป็ด 3 ฟอง\n"
          "5.น้ำเปล่า 3 ถ้วยตวง\n"
          "6.น้ำตาลทราย 3 ถ้วยตวง (สำหรับทำน้ำเชื่อม)\n"
          "7.ใบเตยมัด 1 มัด\n"
          "8.กลิ่นมะลิ ½ ช้อนชา",
      description:
      "1.เทถั่วเขียวนึ่งและบดเรียบร้อยแล้วลงในกระทะ ตามด้วยน้ำตาลทราย (สำหรับทำไส้ถั่ว) และกะทิลงไป ผัดด้วยไฟกลางจนส่วนผสมทั้งหมดเข้ากันและแห้งดีแล้วปิดเตา\n"
          "2.นวดขนมอีกครั้งให้เป็นก้อนแล้วพักไว้รอให้อุ่น ๆ จากนั้นปั้นขนมเป็นก้อน ๆให้มีลักษณะเหมือนเม็ดขนุน\n"
          "3.ใส่น้ำ น้ำตาลทราย (สำหรับทำน้ำเชื่อม) ใบเตยมัด และกลิ่นมะลิลงในกะทะทองเหลือง หรือภาชนะก้นลึกที่สามารถตั้งไฟได้ เคี่ยวน้ำเชื่อมจนเหนียวเป็นยางมะตูมแล้วปิดไฟ\n"
          "4.ตีไข่แดงให้พอแตก นำแป้งที่ปั้นเป็นเม็ดขนุนลงไปชุบไข่แดงให้ทั่ว แล้วหยอดลงไปในหม้อน้ำเชื่อจนหมด\n"
          "5.เสร็จแล้วจึงนำน้ำเชื่อมกลับไปตั้งไฟ โดยใช้ไฟอ่อนอีกครั้ง ขั้นตอนนี้จะต้องให้น้ำเชื่อมนิ่งไม่มีการเดือดใดๆ\n"
          "6.เมื่อขนมสุกแล้วก็ใช้กระชอนตักขึ้นมาเสิร์ฟในจาน",
      image:"assets/images/20.png"
  ),
];