class Dessert {
  final int id;
  final String name;
  final String iconImage;
  final String type;
  final String ingredient;
  final String description;
  final String image;

  Dessert({
    this.id,
    this.name,
    this.iconImage,
    this.type,
    this.ingredient,
    this.description,
    this.image,
  });
}

List<Dessert> dessert = [
  // bakery
  Dessert(
      id : 1,
      name: "แซนวิชผลไม้",
      iconImage:"assets/images/s01.png",
      type: "เบเกอรี่",
      ingredient:
          "1.ขนมปังแซนด์วิชตัดขอบ 4 แผ่น\n"
          "2.วิปปิ้งครีม 50 มิลลิลิตร\n"
          "3.โยเกิร์ตรสธรรมชาติ 50 กรัม\n"
          "4.น้ำตาลทราย 1 ช้อนโต๊ะ\n"
          "5.สตรอว์เบอร์รี หั่นเป็นชิ้น\n"
          "6.กีวี ปอกเปลือกหั่นเป็นชิ้น\n"
          "7.ลูกพีชในน้ำเชื่อม",
      description:
          "1.ใส่น้ำตาลทราย และโยเกิร์ตแช่เย็นลงในวิปปิ้งครีม ตีผสมจนขึ้นฟูเป็นเนื้อโฟม\n"
          "2.ปาดครีมลงบนขนมปังแซนด์วิชให้ทั่ว วางผลไม้ลงบนครีม ปาดทับด้วยครีม\n"
          "จากนั้นนำเข้าแช่เย็น ประมาณ 30 นาทีถึง 1 ชั่วโมงก่อนรับประทาน จากนั้นนำออกจากตู้เย็น"
          "ตัดเป็นชิ้น ๆ พร้อมเสิร์ฟ",
      image:"assets/images/01.png"
  ),
  Dessert(
      id : 2,
      name: "ขนมไข่",
      iconImage:"assets/images/s02.png",
      type: "เบเกอรี่",
      ingredient:
          "1.แป้งเค้ก 100 กรัม\n"
          "2.น้ำตาลทราย 100 กรัม\n"
          "3.ผงฟู ½ ช้อนชา\n"
          "4.ไข่ไก่เบอร์0 3 ฟอง\n"
          "5.กลิ่นวานิลลา ½ ช้อนชา\n"
          "6.น้ำมะนาว 1 ช้อนชา",
      description:
          "1.ตอกไข่ใส่ชามผสม แล้วตีด้วยตะกร้อจนไข่เริ่มขึ้นฟู แล้วทยอยใส่น้ำตาลลงไปขณะตีจนหมด\n"
          "2.ตีไข่จนตั้งยอดอ่อนจากนั้นใส่น้ำมะนาวลงไปแล้วคนให้เข้ากัน\n"
          "3.ร่อนแป้งกับผงฟูแล้วค่อย ๆ เทแป้งลงไปผสมกับไข่ ตะล่อมจนแป้งละลายหมด ใส่กลิ่นวานิลลาแล้วตะล่อมแป้งอีกครั้ง\n"
          "4.เทส่วนผสมแป้งลงในพิมพ์ที่จะใช้อบประมาณ ¾ ของพิมพ์หรืออย่าล้นพิมพ์ขึ้นมา\n"
          "5.วอร์มเตาอบใช้ไฟบน-ล่างและพัดลม อุณหภูมิ 180 องศาเซลเซียส แล้วนำขนมเข้าอบเป็นเวลา 15-20 นาทีจนขนมมีสีน้ำตาลและกรอบ",
      image:"assets/images/02.png"
  ),
  Dessert(
      id : 3,
      name: "โรลเค้ก",
      iconImage:"assets/images/s03.png",
      type: "เบเกอรี่",
      ingredient:
          "1.ไข่แดง 2 ฟอง\n"
          "2.น้ำตาล 23 กรัม\n"
          "3.น้ำมันรำข้าว 25 กรัม\n"
          "4.น้ำ 25 กรัม\n"
          "5.แป้งเค้ก 45 กรัม\n"
          "6.ไข่ขาว 2 ฟอง\n"
          "7.น้ำตาล 23 กรัม\n"
          "8.กลิ่นวานิลลา 1 ช้อนชา\n"
          "9.ครีมสด 200 กรัม\n"
          "10.นมข้นหวาน 25 กรัม\n"
          "11.แยมสตรอเบอรี่\n"
          "12.สตรอว์เบอร์รี่",
      description:
          "1.ผสมไข่แดง กลิ่นวานิลลา น้ำตาล น้ำมันรำข้าว และน้ำ คนให้เข้ากัน จากนั้นใส่แป้งเค้กลงไปคนให้เข้ากัน พักไว้\n"
          "2.ตีไข่ขาวกับน้ำตาล ทยอยใส่น้ำตาล ตีจนตั้งยอดอ่อนแล้วนำมาผสมกับไข่แดงที่เตรียมไว้ โดยแบ่งส่วนผสม 2 ครั้ง ครั้งแรกตะล่อมด้วยตะกร้อมือให้เข้ากัน อีกครึ่งที่เหลือใช้พายยางคนอย่างเบามือจนส่วนผสมเข้ากันดี\n"
          "3.เทส่วนผสมทั้งหมดลงในถาดอบ ปาดหน้าให้เรียบ นำเข้าเตาอบที่ 180 องศาเซลเซียส เป็นเวลา 10-15 นาที ไฟบนล่าง\n"
          "4.เมื่อแป้งสุกแล้ว นำแป้งออกจากพิมพ์ให้พักไว้ให้เย็น\n"
          "5.เตรียมตีครีมสด ผสมกับนมข้นหวาน ตีจนตั้งยอดแข็ง\n"
          "6.ปาดครีมสดและแยมสตรอเบอรี่ลงบนตัวแป้ง และม้วนให้เป็นโรลกลม นำเข้าตู้เย็น 10นาที\n"
          "7.นำโรลออกจากตู้เย็น แต่งหน้าด้วยครีมสด และสตรอว์เบอรี่",
      image:"assets/images/03.png"
  ),
  Dessert(
      id : 4,
      name: "เค้กชิฟฟ่อน",
      iconImage:"assets/images/s04.png",
      type: "เบเกอรี่",
      ingredient:
          "บัตเตอร์ครีม\n"
          "1.เนยสดชนิดเค็มพักไว้พอนุ่ม 560 กรัม\n"
          "2.เนยขาว 250 กรัม\n"
          "3.แบะแซ 1/4 ถ้วยตวง\n"
          "4.น้ำตาลทราย 300 กรัม\n"
          "5.น้ำเปล่า 80 กรัม\n"
          "6.เกลือป่นละเอียด 1 ช้อนชา\n"
          "7.ไข่ไก่ (เฉพาะไข่ขาว) 280 กรัม\n"
          "8.นมข้นหวาน 100 กรัม\n"
          "เค้กชิฟฟ่อนใบเตย\n"
          "1.แป้งเค้ก 275 กรัม\n"
          "2.แป้งข้าวโพด 15 กรัม\n"
          "3.ผงฟู 2 1/2 ช้อนชา\n"
          "4.น้ำตาลทราย 140 กรัม\n"
          "5.ไข่ไก่ (เฉพาะไข่แดง) 11 ฟอง\n"
          "6.น้ำเปล่า 80 กรัม\n"
          "7.น้ำใบเตย 100 กรัม\n"
          "8.กลิ่นวานิลลา 1 ช้อนโต๊ะ\n"
          "9.น้ำมันพืช 130 กรัม\n"
          "10.เกลือป่นละเอียด 1 ช้อนชา\n"
          "11.ไข่ไก่ (เฉพาะไข่ขาว) 12 ฟอง\n"
          "12.ครีมออฟทาร์ทาร์ 1 ช้อนชา\n"
          "13.น้ำตาลทราย (2) 220 กรัม\n"
          "14.สีผสมอาหารสีเขียว\n"
          "15.กระดาษสำหรับห่อเค้ก\n"
          "16.ถาดอบขนาด 11x15x2 นิ้ว จำนวน 2 ใบ",
      description:
      "บัตเตอร์ครีม\n"
          "1. ผสมน้ำตาลทราย แบะแซ น้ำเปล่า และเกลือป่น ยกขึ้นตั้งไฟ พอเดือด\n"
          "2. ตีไข่ขาวด้วยหัวตีตะกร้อโดยใช้ความเร็วสูงสุดของเครื่องจนขึ้นฟู\n"
          "3. ค่อย ๆ ใส่น้ำเชื่อมในข้อที่ 1 ขณะร้อน ๆ ลงไปเป็นสาย ตีต่อจนขึ้นฟูและเย็นสนิท\n"
          "4. ใส่เนยสดและเนยขาวตีพอเข้ากัน ใส่นมข้นหวานตีต่อจนมีลักษณะฟูและเนียนเป็นครีม\n"
          "เค้กชิฟฟ่อนใบเตย\n"
          "1. ทาถาดด้วยเนยขาว แล้วรองด้วยกระดาษไข ทาเนยขาวอีกครั้งจนทั่ว พักไว้\n"
          "2. ร่อนแป้งเค้ก แป้งข้าวโพด และผงฟูเข้าด้วยกันลงในอ่างผสม เตรียมไว้\n"
          "3. ผสมไข่แดง น้ำตาลทราย (1) น้ำเปล่า น้ำใบเตย กลิ่นวานิลลาน้ำมันพืช และเกลือป่น ผสมจนส่วนผสมละลายดี เทลงในส่วนผสมแป้งที่ร่อนไว้ คนด้วยตะกร้อมือจนเข้ากัน พักไว้\n"
          "4. ตีไข่ขาวกับครีมออฟทาร์ทาร์ด้วยหัวตีตะกร้อโดยใช้ความเร็วสูงสุดของเครื่องพอขึ้นฟู ค่อย ๆ เติมน้ำตาลทราย (2) ทีละน้อยจนหมด ตีต่อจนส่วนผสมตั้งยอดอ่อน นำไข่ขาวค่อย ๆ แบ่งลงผสมกับส่วนผสมในข้อที่ 3 จนหมด เติมสีเขียวตะล่อมเบา ๆ ด้วยตะกร้อมือและพายยางจนเข้ากันดี\n"
          "5. เทใส่ถาดอบที่เตรียมไว้เท่า ๆ กัน นำเข้าอบที่อุณหภูมิ 350 องศาฟาเรนไฮต์ ประมาณ 30-40 นาทีหรือจนสุก นำออกจากเตาอบแซะออกจากถาดพักขนมบนตะแกรงจนเย็นสนิท\n"
          "6. ปาดบัตเตอร์ครีมลงบนเนื้อเค้กจนทั่ว ประกบด้วยเค้กอีกชิ้นตัดเป็นชิ้นสามเหลี่ยม แล้วห่อด้วยกระดาษ",
      image:"assets/images/04.png"
  ),
  Dessert(
      id : 5,
      name: "บราวนี่",
      iconImage:"assets/images/s05.png",
      type: "เบเกอรี่",
      ingredient:
          "1.แป้งสาลีอเนกประสงค์ 90 กรัม\n"
          "2.ผงโกโก้ 30 กรัม\n"
          "3.ดาร์กช็อคโกแลต 64% 120 กรัม\n"
          "4.เนยสดรสเค็ม 120 กรัม\n"
          "5.ไข่ไก่ 2 ฟอง\n"
          "6.น้ำตาลทราย 160 กรัม\n"
          "7.เกลือป่น 1/2 ช้อนชา\n"
          "8.กลิ่นวานิลลา 2 ช้อนชา\n"
          "9.แอลม่อนสไลด์ 100 กรัม",
      description:
          "1.นำแป้งสาลีอเนกประสงค์ ผงโกโก้ ร่อนลงไปในชามผสมประมาณ 2 ครั้ง พักไว้\n"
          "2.นำดาร์กช็อกโกแลตและเนยสดไปละลาย คนให้เข้ากัน พักไว้\n"
          "3.จากนั้นนำเนยขาวลงไปทาในพิมพ์ ตามด้วยกระดาษไข และทาเนยขาวลงไปอีกครั้ง\n"
          "4.นำไข่ไก่สองฟอง น้ำตาลทราย คนผสมให้เข้ากัน เติมเกลือป่น และกลิ่นวานิลลา และคนผสมให้เข้ากันอีกครั้ง\n"
          "5.นำช็อกโกแลตที่ละลายไว้ลงไป คนให้เข้ากัน\n"
          "6.จากนั้นใส่แป้งที่ร่อนไว้ลงไป แบ่งใส่ประมาณ 2 ครั้ง คนผสมให้เข้ากัน\n"
          "7.จากนั้นนำอัลมอนต์สไลด์ใส่ลงไปในส่วนผสมบราวนี่ ตะล่อมให้เข้ากัน\n"
          "8.เทใส่แท่นพิมพ์ จากนั้นโรยด้วยอัลมอนต์สไลด์ไว้ด้านบน นำไปอบด้วยอุณหภูมิ 180 องศา ใช้เวลา 25-30 นาที",
      image:"assets/images/05.png"
  ),
  Dessert(
      id : 6,
      name: "เค้กวานิลลา",
      iconImage:"assets/images/s06.png",
      type: "เบเกอรี่",
      ingredient:
          "เนื้อเค้ก\n"
          "1.แป้งเค้ก155 กรัม\n"
          "2.แป้งสาลีอเนกประสงค์130 กรัม\n"
          "3.ผงฟู2 ช้อนชา\n"
          "4.เกลือ ½ ช้อนชา\n"
          "5.เนยจืด170 กรัม\n"
          "6.น้ำตาลทราย310 กรัม\n"
          "7.ไข่ไก่3 ฟอง\n"
          "8.นมข้นจืด180 มิลลิลิตร\n"
          "9.กลิ่นวานิลลา1 ช้อนโต๊ะ\n"
          "ครีม\n"
          "1.ไข่ขาว3 ฟอง\n"
          "2.ครีมออฟทาร์ทาร์¼ ช้อนชา\n"
          "3.น้ำตาลทราย180 กรัม\n"
          "4.น้ำสะอาด3 ช้อนโต๊ะ",
      description:
          "1.เปิดเตาอบที่ 170 องศาเซลเซียส โปรแกรมไฟล่าง-ไฟบน เตรียมพิมพ์อบขนาด 7 นิ้ว 3 ถาด ทาเนย และรองกระดาษไข\n"
          "2.ร่อนแป้งทั้งสองชนิด ผงฟู และเกลือ พักไว้"
          "3.ตีเนยให้นุ่มดี ใส่น้ำตาลทราย ตีต่อจนเข้ากันดี ใส่ไข่ไก่ลงไปทีละฟอง ตีให้เข้ากันก่อนใส่ฟองถัดไป ตามด้วยวานิลลา\n"
          "4.แบ่งส่วนผสมของแห้งเป็น 3 ส่วน และนมข้นจืด 2 ส่วน ใส่แป้งส่วนแรกลงไป ลดความเร็ว ตีจนส่วนผสมเข้ากัน ใส่นมส่วนแรกตามลงไป ตีให้พอเข้ากัน แล้วจึงใส่แป้งส่วนที่สอง นมส่วนที่สอง และแป้งส่วนสุดท้ายตามลำดับ\n"
          "5.แบ่งส่วนผสมเป็นสามส่วนเท่าๆ กัน ใส่ลงในพิมพ์ที่เตรียมไว้ อบเป็นเวลา 30 นาที พักให้เย็นลง นำออกจากพิมพ์\n"
          "6.ทำครีม โดยนำน้ำตาลทราย และน้ำไปตั้งไฟ เคี่ยวให้น้ำเชื่อมข้นมีลักษณะเหมือนยางมะตูม หรือมีอุณหภูมิอยู่ที่ 118-121 องศาเซลเซียส\n"
          "7.ระหว่างต้มน้ำเชื่อม ตีไข่ขาวกับครีมออฟทาร์ทาร์ ด้วยหัวตีตะกร้อ ตีจนส่วนผสมตั้งยอดอ่อน ค่อยๆ เทน้ำเชื่อมลงไปเป็นสายจนหมด เร่งความเร็ว ตีต่อจนส่วนผสมเนื้อแน่นและมีลักษณะที่เงาดี\n"
          "8.ปาดครีมลงบนเค้กทั้งสามชั้น และปาดด้านข้าง พร้อมรับประทาน",
      image:"assets/images/06.png"
  ),
  Dessert(
      id : 7,
      name: "พายสัปปะรด",
      iconImage:"assets/images/s07.png",
      type: "เบเกอรี่",
      ingredient:
          "สับปะรดกวน\n"
          "1.เนื้อสับปะรดสับละเอียด 500 กรัม (ใช้สับปะรดสด หรือสับปะรดกระป๋องก็ได้)\n"
          "2.น้ำตาลทราย 90 กรัม\n"
          "4.เกลือป่น 1/4 ช้อนชา\n"
          "5.เนยสด 1/2 ช้อนโต๊ะ (ไม่ใส่ก็ได้)\n"
          "แป้งพาย\n"
          "1.แป้งสาลีอเนกประสงค์ 115 กรัม\n"
          "2.ผงฟู 1/8 ช้อนชา\n"
          "3.เบกกิ้งโซดา 1/8 ช้อนชา\n"
          "4.นมผง 3 ช้อนโต๊ะ\n"
          "5.เกลือป่น 1/8 ช้อนชา\n"
          "6.เนยสดหั่นชิ้นเล็ก ๆ 85 กรัม\n"
          "7.เนยขาว 25 กรัม\n"
          "8.ไข่แดง 1 ฟอง\n"
          "9.น้ำตาลวานิลลา 1/2 ช้อนชา\n"
          "10.น้ำตาลไอซิ่ง 20-25 กรัม\n"
          "11.ไข่แดง (สำหรับทาหน้าพาย)",
      description:
          "1.ทำไส้สับปะรดกวนโดยใส่สับปะรดสับลงในหม้อ ใช้ไฟกลาง เติมน้ำตาลทรายกับเกลือป่นลงไป กวนให้เข้ากันจนสับปะรดเหนียวเป็นก้อน ปิดไฟใส่เนยสดลงไป กวนให้เข้ากัน ยกลงจากเตา\n"
          "2.ทำแป้งพายโดยนำส่วนผสมทุกอย่างใส่ลงในเครื่องปั่นอาหาร ปั่นจนละเอียดเข้ากัน นำออกมาห่อด้วยพลาสติกถนอมอาหาร เสร็จแล้วนำเข้าตู้เย็นประมาณ 30 นาที พอครบเวลานำแป้งออกมารีดเป็นแผ่น ความหนาประมาณ 1/4 นิ้ว\n"
          "3.ทำแป้งพายเป็นรูปกังหันโดยวางไส้สับปะรดกวนลงไปตรงกึ่งกลาง ตัดมุมทั้ง 4 เข้าหาไส้สับปะรด จากนั้นยกมุมแป้งขึ้นไปปิดไส้สับปะรดให้เรียงกันเป็นรูปกังหัน หรือจะห่อด้วยการพับมุม 2 มุมทบลงมาตรงกึ่งกลางไส้สับปะรดกวนก็ได้ นำมาวางเรียงลงบนถาดที่ปูกระดาษรองอบไว้แล้ว ทาไข่แดงบนแป้งพายให้ทั่ว\n"
          "4.นำเข้าอบที่อุณหภูมิ 170 องศาเซลเซียส ประมาณ 15 นาทีหรือจนแป้งพายสุกสีเหลืองสวย นำออกจากเตาอบ พักไว้บนตะแกรงให้เย็น พร้อมเสิร์ฟ",
      image:"assets/images/07.png"
  ),
  Dessert(
      id : 8,
      name: "ครัวซองต์",
      iconImage:"assets/images/s08.png",
      type: "เบเกอรี่",
      ingredient:
          "1.แป้งขนมปัง 500 กรัม\n"
          "2.ยีสต์ 10 กรัม\n"
          "3.นมสด 1 ถ้วย\n"
          "4.น้ำตาล ¼ ถ้วย\n"
          "5.เกลือ 7 กรัม\n"
          "6.เนยสดจืด 250 กรัม",
      description:
          "1.ผสมแป้ง โดยการเทนม แป้งขนมปัง ยีสต์ และ น้ำตาล แล้วนวดให้เข้ากัน ทิ้งไว้ประมาณ 5 นาที\n"
          "2.เอาพลาสติกใสห่อแป้ง แล้วนำแป้งไปแช่ในตู้เย็นประมาณ 1 ชั่วโมง\n"
          "3.ทำเนย โดยการตัดกระดาษไข แล้วรีดเนยให้ขนาดเท่า A5 เอาไปแช่เย็น\n"
          "4.เอาเนยให้เข้าไปอยู่ในตัวแป้ง โดยอย่างแรกให้รีดแป้งให้มีขนาดเท่าขนาด A4\n"
          "5.นำเนยวางไว้ตรงกลางของแป้ง แล้วลอกเนยออกจากกระดาษไขออก แล้วพับแป้งเข้าไปให้หุ้มเนย\n"
          "6.ห่อด้วยพลาสติกใส นำไปแช่เย็น 30 นาที\n"
          "7.รีดให้ยาว 45 เซนติเมตร กว้าง 20 พับครึ่งของแป้ง แล้วทบอีกฝั่ง จากนั้นห่อพลาสติกใส แช่เย็นอีก 30 นาที\n"
          "8.รีดแป้งอีกหนึ่งครั้งให้ยาว 50 เซนติเมตร กว้าง 20 เซนติเมตร แล้วพับสองด้านของแป้งชิดเข้าหากัน และพับเข้าหากัน จากนั้นห่อพลาสติกใส แช่เย็นอีก 30 นาที\n"
          "9.ขึ้นรูปครัวซองต์ ให้ยาว 50 เซนติเมตร กว้าง 20 เซนติเมตร ให้มีความหนาประมาณ 3 มิลลิเมตร\n"
          "10.ตัดแป้งประมาณ 4 นิ้ว โดยการตัดมุมเฉียง ให้เหมือนชิ้นพิซซ่า แล้วขึ้นรูปครัวซองต์ โดยการม้วนตรงด้านเส้นตรงเข้าหามุมแหลม นำเอาครัวซองต์ไปใส่ถาดอบ\n"
          "11.ตีไข่ไก่และนมสดลงไป แล้วกรองเอาไข่ขาวออก ทาไข่ลงบนแป้งครัวซอง\n"
          "12.นำเอาแป้งครัวซองต์ไปอบ 190 องศา ประมาณ 20 นาที พร้อมเสิร์ฟ",
      image:"assets/images/08.png"
  ),
  Dessert(
      id : 9,
      name: "คุกกี้",
      iconImage:"assets/images/s09.png",
      type: "เบเกอรี่",
      ingredient:
          "1.น้ำตาลทรายแดง 100 กรัม\n"
          "2.น้ำตาลมะพร้าว 50 กรัม\n"
          "3.เกลือ 5 กรัม\n"
          "4.เบกกิ้งโซดา 2 กรัม\n"
          "5.ช็อกโกแลตชิพ 75 กรัม\n"
          "6.เนย 100 กรัม\n"
          "7.ไข่ไก่ 1 ฟอง\n"
          "8.แป้งสาลีอเนกประสงค์ 200 กรัม",
      description:
          "1.ตีเนยในชาม\n"
          "2.ค่อยๆ ใส่ น้ำตาลทรายแดง และน้ำตาลมะพร้าว ใช้เครื่องตีความเร็วปานกลาง เมื่อเข้ากันดีแล้ว ให้ใส่ไข่ ต่อจากนั้นใส่ของแห้ง แป้งสาลีอเนกประสงค์ เบกกิ้งโซดา และเกลือ เมื่อเข้ากันแล้ว ใส่ช็อกโกแลตชิพลงไป เปิดเครื่องตีเบาๆ\n"
          "3. ใช้สคูปไอศกรีมตักเป็นลูก ลูกละประมาณ 25 กรัมต่อชิ้น\n"
          "4. นำไปอบในอุณหภูมิ 180 องศาเซลเซียส เป็นเวลา 6 นาที พร้อมเสิร์ฟ",
      image:"assets/images/09.png"
  ),
  Dessert(
      id : 10,
      name: "ทาร์ตไข่",
      iconImage:"assets/images/s10.png",
      type: "เบเกอรี่",
      ingredient:
          "1.แป้งพายถ้วย 12 ถ้วย\n"
          "2.ไข่ไก่ 2 ฟอง\n"
          "3.ไข่แดง 2 ฟอง\n"
          "4.นมสด 250 กรัม\n"
          "5.น้ำตาลทราย 70 กรัม\n"
          "6.วนิลา 1/2 ช้อนชา\n"
          "7.เนยสด 20 กรัม",
      description:
      "1.ตั้งกระทะ ใส่นมสด พอเดือด ใส่น้ำตาลทราย เนยเค็ม กลิ่นวนิลา คนพอเข้ากันปิดไฟ พักไว้\n"
          "2.ตอกไข่ใส่ชามผสม ไข่ทั้งใบ 2 ฟอง ไข่แดงอีก 2 ฟอง คนไข่ให้เนียนเข้ากันดีค่อยๆ ใส่นมที่ต้มลงไป ใส่ทีละน้อยๆ แล้วคนให้เข้ากัน อย่าใส่ครั้งเดียวหมดไข่ไก่จะสุก ทำแบบนี้จนเสร็จเลย แล้วเอาไปกรองด้วยตะแกรงตาถี่ พักไว้ก่อน\n"
          "3.เตรียมถาดสำหรับอบ วางถ้วยแป้งพาย แล้วค่อยๆ หยอดไข่ใส่พิมพ์ ให้เต็มพอดี เอาเข้าเตาอบ\n"
          "4.วอร์มเตาอบ 150 องศา ประมาณ 20 นาทีก่อน จากนั้นเอาขนมเข้าอบ ไฟบน-ล่าง ประมาณ 30-40 นาที หรือจนกว่าจะได้หน้าขนมที่เหลืองสวยตามต้องการ พออบสุกแล้วก็จัดใส่จาน พร้อมเสิร์ฟ",
      image:"assets/images/10.png"
  ),
  // thai desert
  Dessert(
      id : 11,
      name: "กล้วยบวชชี",
      iconImage:"assets/images/s11.png",
      type: "ขนมไทย",
      ingredient:
          "1.กล้วยน้ำว้า 8 ลูก (เลือกห่าม ๆ ไม่สุกมาก)\n"
          "2.หัวกะทิ 225 มิลลิลิตร\n"
          "3.หางกะทิ 300 มิลลิลิตร\n"
          "4.ใบเตย 2 ใบ\n"
          "5.น้ำตาลปี๊บ 30 กรัม\n"
          "6.น้ำตาลทรายขาว 20 กรัม\n"
          "7.เกลือ ¼ ช้อนชา\n"
          "8.แป้งมัน 1 ช้อนชา",
      description:
      "1นำกล้วยทั้งเปลือกไปนึ่งในน้ำเดือด ประมาณ 3 - 5 นาที แล้วปิดไฟ\n"
          "2.ปอกเปลือกและหั่นกล้วยเป็นชิ้นเล็ก ๆ\n"
          "3.ตั้งหม้อไฟกลาง ใส่หางกะทิและใบเตยลงไป ต้มจนเดือด\n"
          "4.ใส่น้ำตาลปี๊บ น้ำตาลทรายขาว และเกลือลงไป คนให้ละลาย\n"
          "5.ใส่กล้วยที่หั่นไว้ลงไป ต้มให้เดือดอีกครั้ง\n"
          "6.ใส่หัวกะทิลงไป และปล่อยทิ้งไว้ให้เดือดอีกประมาณ 3 นาที พร้อมเสิร์ฟ",
      image:"assets/images/11.png"
  ),
  Dessert(
      id : 12,
      name: "ขนมใส่ไส้",
      iconImage:"assets/images/s12.png",
      type: "ขนมไทย",
      ingredient:
          "1.มะพร้าวขูดขาว 2+1/2 ถ้วย\n"
          "2.น้ำตาลมะพร้าว 1+1/2 ถ้วย\n"
          "3.น้ำต้มสุก\n"
          "4.เทียนสำหรับอบควันเทียน (ใช้หรือไม่ใช่ก็ได้ตามความสะดวก)\n"
          "5.แป้งข้าวเหนียว 2 ถ้วย\n"
          "6.น้ำเย็น 1/3 ถ้วย (หรือน้ำใบเตย, น้ำอัญชันแช่เย็น หากต้องการเพิ่มสีสัน)\n"
          "7.แป้งข้าวเจ้า 1/3 ถ้วย\n"
          "8.เกลือป่น 2 ช้อนชา\n"
          "9.หัวกะทิ 3+1/3 ถ้วย\n"
          "10.ใบตอง/ ใบมะพร้าว\n"
          "11.ไม้กลัด",
      description:
          "เตรียมใบตอง\n"
          "1.ตัดใบตองเป็น 2 ขนาด แผ่นใหญ่ขนาดประมาณ 5X9 เซนติเมตร และแผ่นเล็กขนาดประมาณ 4X6 เซนติเมตร\n"
          "2.ตัดหัว-ท้ายเป็นสามเหลี่ยม เช็ดให้สะอาดทั้ง 2 ด้าน นำไปตากแดดทิ้งไว้สักครู่ (เพื่อไม่ให้ใบตองแตกขณะห่อขนม)\n"
          "ส่วนผสมไส้ขนม\n"
          "1.กวนมะพร้าวขูดกับน้ำตาลมะพร้าว และน้ำต้มสุกในกระทะด้วยไฟอ่อน ๆ จนส่วนผสมเหนียวและแห้ง ยกลงจากเตา พักทิ้งไว้จนเย็นสนิท\n"
          "2.พอส่วนผสมเย็นสนิทแล้วปั้นเป็นก้อนกลม ๆ ประมาณ 1 นิ้วใส่ในภาชนะที่มีฝาปิด\n"
          "3.นำส่วนผสมไส้ไปอบด้วยควันเทียน เตรียมไว้\n"
          "ทำแป้ง\n"
          " นวดแป้งข้าวเหนียวกับน้ำเย็นจนพอปั้นได้ จากนั้นปั้นเป็นก้อนกลมขนาดเดียวกับหน้าไส้ที่เตรียมไว้\n"
          "ผสมหน้าขนม\n"
          " ผสมแป้งข้าวเจ้า เกลือป่น และกะทิคนให้ละลายเข้าด้วยกัน เทใส่ในกระทะทองเหลือง (หรือกระทะเทฟลอน) ใช้ไฟปานกลางกวนจนข้นและเดือดทั่ว ยกลงจากเตา เตรียมไว้\n"
          "ทำขนมใส่ไส้แบบห่อใบตอง\n"
          "1.แผ่แป้งข้าวเหนียวที่ปั้นไว้เป็นแผ่นบาง ๆ (พอหุ้มไส้ได้มิด) จากนั้นหยิบไส้ขนมวางลงไปตรงกลางแล้วหุ้มแป้งให้มิด วางขนมลงบนใบตองที่ซ้อนกัน\n"
          "2.หงายใบตองแผ่นใหญ่ขึ้น (ด้านนวล) แล้ววางทับด้วยใบตองแผ่นเล็ก วางไส้ขนมลงไป จากนั้นตักหน้าขนมประมาณ 1/2 ช้อนชา ใส่ด้านบนไส้\n"
          "3.ห่อใบตองเป็นทรงสูง ใช้ใบมะพร้าวที่เตรียมไว้คาดและกลัดด้วยไม้กลัดให้เรียบร้อย ตัดปลายเตี่ยวให้เฉียงและยาวพองาม วางเรียงห่อขนมลงในชุดนึ่ง\n"
          "4.นำขนมไปนึ่งในชุดนึ่งที่มีน้ำเดือดพล่านประมาณ 10 นาที ยกลงจากเตา",
      image:"assets/images/12.png"
  ),
  Dessert(
      id : 13,
      name: "ข้าวต้มมัด",
      iconImage:"assets/images/s13.png",
      type: "ขนมไทย",
      ingredient:
          "1.ข้าวเหนียวเขี้ยวงู (ข้าวเก่า) 1 กิโลกรัม\n"
          "2.หัวกะทิ ปนหางกะทินิดหน่อย 1 กิโลกรัม\n"
          "3.น้ำตาลทรายขาว 3 ขีดครึ่ง\n"
          "4.เกลือ 1 ช้อนโต๊ะพูนๆ\n"
          "5.น้ำมันพืช 3 ช้อนโต๊ะ\n"
          "6.กล้วยน้ำว้าค่อนข้างสุก ประมาณ 1 หวี\n"
          "7.ั่วดำ ครึ่งกิโลกรัม (แช่น้ำทิ้งไว้ 1 คืน)\n"
          "8.ใบเตย 1 กำมือ\n"
          "9.ใบตองกล้วยน้ำว้า เช็ดให้สะอาด\n"
          "10.ตอกมัดข้าวต้ม",
      description:
          "1.ซาวข้าวเหนียวด้วยสารส้ม 3 น้ำ ล้างให้ดี แล้วแช่น้ำพักไว้\n"
          "2.ตั้งกระทะเปิดไฟ เอากะทิลงเคี่ยว ใส่ใบเตย ใช้ไฟปานกลาง เคี่ยวไปเรื่อยๆ เอาให้เดือดสักพักใหญ่ แล้วใส่เกลือ\n"
          "3.หันไปซาวข้าวเหนียวขึ้น แล้วใส่หวด (ที่นึ่งข้าวเหนียว) สะเด็ดน้ำให้แห้ง\n"
          "4.ข้าวสะเด็ดน้ำแล้ว นำไปเทลงไปผัดกับกะทะที่เคี่ยวไว้ก่อนหน้านี้ เปิดไฟปานกลาง กวนไปจนกว่าจะแห้ง\n"
          "5.ใส่น้ำมันพืชลงไปเพื่อไม่ให้ข้าวติดกะทิ\n"
          "6.ใส่น้ำตาลทราย กวนต่อจนกว่าจะแห้ง\n"
          "7.จากนั้นปิดไฟ พักไว้\n"
          "8.ล้างถั่วดำที่แช่ค้างคืนให้สะอาด จากนั้นนำไปต้ม ไฟปานกลาง พอเดือดแล้วหรี่ไฟ ต้มไปเรื่อยๆ ต้มให้เปื่อย บี้ถั่วดูว่าเปื่อยหรือยัง\n"
          "9.หลังจากนั้น ยกขึ้นกรองน้ำออกให้ถั่วสะเด็ดน้ำ\n"
          "10.เอาตอกไปฉีกครึ่ง (ก่อนมัดนำไปแช่น้ำประมาณ 15 นาทีเพื่อให้ตอกนิ่มมัดง่าย)\n"
          "11.กล้วยนำไปผ่าครึ่ง\n"
          "12.จากนั้นลงมือห่อแล้วนำไปนึ่งทิ้งไว้ 2 ชม.\n"
          "13.นำออกจากซึ้งนึ่งเอาข้าวต้มมัดออกมาผึ่งใส่กระจาดเพื่อไม่ให้ข้าวแฉะ พร้อมเสิร์ฟ",
      image:"assets/images/13.png"
  ),
  Dessert(
      id : 14,
      name: "ขนมมันม่วง",
      iconImage:"assets/images/s14.png",
      type: "ขนมไทย",
      ingredient:
          "1.มันม่วงนึ่ง250 กรัม\n"
          "2.แป้งมัน15 กรัม\n"
          "3.กะทิ250 กรัม\n"
          "4.แป้งข้าวจ้าว100 กรัม\n"
          "5.น้ำตาลทราย120 กรัม\n"
          "6.เกลือป่น1/2 ช้อนชา\n"
          "7.มะพร้าวขูด",
      description:
          "1.ผสมแป้งข้าวจ้าว แป้งมัน น้ำตาลทราย เกลือ ลงในกะละมัง เทน้ำกะทิลงไปทีละน้อยจนหมด ใส่มันม่วงนึ่งสุกลงไป ขยำจะเป็นเนื้อเดียวกัน\n"
          "2.หมักส่วนผสมข้อที่ 1 ไว้ประมาณ 10 นาที จากนั้นตักหยอดลงในกระทงใบตองที่ทำไว้\n"
          "3.นึ่งขนมด้วยไฟกลางประมาณ 20 นาทีและยกลง โรยหน้าด้วยมะพร้าวขูด",
      image:"assets/images/14.png"
  ),
  Dessert(
      id : 15,
      name: "ฝอยทอง",
      iconImage:"assets/images/s15.png",
      type: "ขนมไทย",
      ingredient:
          "1.ไข่เป็ด 6 ฟอง\n"
          "2.ไข่ไก่ 3 ฟอง\n"
          "3.น้ำตาลทรายขาว 1 กิโลกรัม\n"
          "4.น้ำลอยดอกมะลิ 1,000 มิลลิลิตร\n"
          "5.ใบเตย (มัดรวมกัน) 4 ใบ\n"
          "6.กรวยใบตองหรือกรวยโลหะ\n"
          "7.ไม้แหลม ยาวประมาณ 1 ฟุต",
      description:
          "1.แยกไข่แดงกับไข่ขาวออกจากกันและรีดไข่น้ำค้าง (ไข่ขาวที่เป็นน้ำใส ๆ เหมือนน้ำค้างติดอยู่ภายในเปลือกไข่) ลงไปในไข่แดง (ไข่น้ำค้างทำให้เส้นฝอยทองเหนียวนุ่ม ไม่ขาดง่าย) ตีผสมไข่แดงให้พอเป็นเนื้อเดียวกัน (ไม่ต้องตีให้ขึ้นฟู เพราะจะทำให้เส้นขาดเวลาโรยลงในกระทะ) จากนั้นนำไปกรองในผ้าขาวบาง เตรียมไว้\n"
          "2.ทำน้ำเชื่อมโดยใส่น้ำลอยดอกมะลิ น้ำตาลทราย และใบเตยลงในหม้อ นำขึ้นตั้งไฟกลางรอจนน้ำตาลละลาย จากนั้นนำไปกรองแล้วเทใส่ลงกระทะทองเหลือง เคี่ยวด้วยไฟอ่อนอีกครั้งจนเป็นเหนียวข้น\n"
          "3.ตักส่วนผสมไข่แดงลงในกรวยแล้วค่อย ๆ โรยไข่แดงลงไปในน้ำเชื่อมที่เดือด (ใช้ไฟกลาง) วนให้รอบกระทะทองเหลืองประมาณ 20-30 รอบต่อชิ้น จากนั้นยกกรวยขึ้น\n"
          "4.พอไข่แดงสุกให้ใช้ไม้ปลายแหลมพับครึ่งเส้นฝอยทองแล้วเอามาพักบนตะแกรงให้สะเด็ดน้ำเชื่อม พร้อมเสิร์ฟ",
      image:"assets/images/15.png"
  ),
  Dessert(
      id : 16,
      name: "ลูกชุบ",
      iconImage:"assets/images/s16.png",
      type: "ขนมไทย",
      ingredient:
          "ถั่วกวน\n"
          "1.ถั่วเขียวเลาะเปลือก (ถั่วทอง) 300 กรัม\n"
          "2.หัวกะทิ 250 กรัม\n"
          "3.น้ำตาลทราย 180 กรัม\n"
          "4.สีผสมอาหาร\n"
          "5.ไม้ปลายแหลม\n"
          "วุ้นสำหรับชุบ\n"
          "6.ผงวุ้น 15 กรัม\n"
          "7.น้ำเปล่า 900 กรัม\n"
          "8.น้ำตาลทราย 100 กรัม\n",
      description:
          "1.ถั่วเขียวเลาะเปลือกล้างให้สะอาด แช่น้ำไว้ข้ามคืน จากนั้นนำมานึ่งหรือหุงให้สุกนุ่ม ใส่ถั่วที่สุกแล้ว น้ำตาลทราย หัวกะทิ ลงในโถปั่นน้ำผลไม้ ปั่นให้ละเอียด\n"
          "2.เทใส่กระทะ ยกขึ้นตั้งไฟกวนจนแห้งล่อนจากกระทะ ยกลงพักไว้ให้เย็น\n"
          "3.ปั้นถั่วเป็นก้อนกลม ใช้ไม้ปลายแหลมช่วยในการขึ้นรูปต่าง ๆ ตามชอบ\n"
          "4.ระบายสีโดยใช้พู่กัน หรือชุบด้วยวิธีจุ่มลงในถ้วยที่ผสมสีไว้ พักไว้ให้สีแห้ง\n"
          "5.ทำวุ้นโดยผสมผงวุ้นกับน้ำเปล่าคนให้เข้ากัน ยกขึ้นตั้งไฟให้เดือดและวุ้นละลายดี ใส่น้ำตาล พอเดือดอีกครั้งยกลงจากเตา กรองด้วยกระชอน\n"
          "6.นำถั่วที่ปั้นไว้ลงชุบในน้ำวุ้น เสียบลงบนแผ่นโฟม พักไว้ให้เย็น ชุบประมาณ 3 รอบหรือจนลูกชุบขึ้นเงาสวย\n"
          "7.ดึงลูกชุบออกจากไม้ปลายแหลม ตัดวุ้นส่วนเกินออก จัดจาน พร้อมเสิร์ฟ",
      image:"assets/images/16.png"
  ),
  Dessert(
      id : 17,
      name: "ขนมชั้น",
      iconImage:"assets/images/s17.png",
      type: "ขนมไทย",
      ingredient:
          "1.แป้งข้าวเจ้า 40 กรัม\n"
          "2.แป้งท้าวยายม่อม 40 กรัม\n"
          "3.แป้งมัน 300 กรัม\n"
          "4.กะทิ 500 มิลลิลิตร\n"
          "5.น้ำตาลทราย 500 กรัม\n"
          "6.ใบเตย 3-4 ใบ\n"
          "7.กลิ่นมะลิ 1/2 ช้อนชา\n"
          "8.น้ำใบเตย 1/4 ถ้วย",
      description:
          "1.ผสมน้ำตาลทรายกับกะทิ แล้วนำไปตั้งไฟอ่อนๆ พอให้อุ่นจนน้ำตาลทรายเริ่มละลาย ไม่ต้องต้มให้เดือด เสร็จแล้ววางพักไว้\n"
          "2.ผสมแป้งทั้งสามอย่างเข้าด้วยกัน แล้วค่อยๆ เติมน้ำกะทิลงไป คนจนแป้งละลาย หากไม่แน่ใจว่าแป้งละลายหมด ให้นำไปกรองกับกระชอนตาถี่\n"
          "3.แบ่งน้ำกะทิไว้สองชาม ชามแรกผสมกลิ่นมะลิลงไป คนให้เข้ากัน อีกหนึ่งชามใส่น้ำใบเตยลงไป คนให้เข้ากัน\n"
          "4.เตรียมพิมพ์สำหรับขนมชั้น ใส่น้ำในลังถึง ต้มน้ำจนเดือด แล้วนำแม่พิมพ์ลงไปนึ่งวอร์มก่อน 15 นาที\n"
          "5.เสร็จแล้วก็เทขนมลงไปทีละชั้น ชั้นละเท่าๆ กัน ระหว่างสลับสีกันให้นึ่งชั้นละ 5 นาที จนเต็มแม่พิมพ์\n"
          "6.นึ่งเสร็จแล้ว นำขนมออกมาหั่นเป็นชิ้นสี่เหลี่ยม จัดเรียงใส่จาน พร้อมเสิร์ฟ",
      image:"assets/images/17.png"
  ),
  Dessert(
      id : 18,
      name: "วุ้นกะทิอัญชัน",
      iconImage:"assets/images/s18.png",
      type: "ขนมไทย",
      ingredient:
          "วุ้นอัญชัน\n"
          "1.น้ำเปล่า 2 ถ้วย (ถ้าต้องการความหอมให้ผสมกลิ่นมะลิ 1 ช้อนชา)\n"
          "2.ผงวุ้น 1 ช้อนโต๊ะ + 2 ช้อนชา\n"
          "3.น้ำอัญชันคั้นเข้มข้น 1/2 ถ้วย\n"
          "4.น้ำตาลทราย 3/4 ถ้วย ถึง 1 ถ้วย\n"
          "วุ้นกะทิ\n"
          "1.กะทิ 2+1/2 ถ้วย\n"
          "2.ผงวุ้น 1 ช้อนโต๊ะ + 2 ช้อนชา\n"
          "3.น้ำตาลทราย 1/2 ถ้วย\n"
          "4.เกลือป่น ปลายช้อนชา",
      description:
          "1.ใส่น้ำและผงวุ้นลงในหม้อ คนให้ผงวุ้นกระจายทั่ว ๆ และไม่เป็นก้อน พักทิ้งไว้สักครู่\n"
          "2.นำส่วนผสมขึ้นตั้งไฟกลางอ่อน คนผสมเรื่อย ๆ จนเริ่มเดือดและผงวุ้นละลายหมด จากนั้นเติมน้ำตาลทรายลงไป คนให้น้ำตาลทรายละลาย\n"
          "3.ใส่น้ำอัญชันคั้นเข้มข้นลงไป คนผสมให้เข้ากัน รอจนเดือดอีกครั้ง ปิดไฟ ยกลงจากเตาแล้วนำส่วนผสมไปกรอง\n"
          "4.เทส่วนผสมวุ้นอัญชันใส่ลงพิมพ์ที่เตรียมไว้ประมาณครึ่งพิมพ์ นำไปแช่เย็นจนเซตตัว เตรียมไว้\n"
          "5.ใส่กะทิลงในหม้อ ตามด้วยผงวุ้น จากนั้นคนให้ผงวุ้นกระจายทั่ว ๆ\n"
          "6.นำขึ้นตั้งไฟกลางค่อนข้างอ่อน คนจนผงวุ้นละลาย และกะทิเริ่มเดือด (แต่ไม่ต้องแตกมัน) จากนั้นเติมน้ำตาลทรายและเกลือลงไป คนให้ละลาย ปิดไฟ ยกลงจากเตา\n"
          "7.ตักส่วนผสมวุ้นกะทิหยอดลงในพิมพ์ทับวุ้นอัญชันจนเต็มพิมพ์ นำไปแช่เย็นจนเซตตัว นำออกจากพิมพ์ พร้อมเสิร์ฟ",
      image:"assets/images/18.png"
  ),
  Dessert(
      id : 19,
      name: "บัวลอยไข่หวาน",
      iconImage:"assets/images/s19.png",
      type: "ขนมไทย",
      ingredient:
          "แป้งบัวลอย\n"
          "1.แป้งข้าวเหนียว 100 กรัม\n"
          "2.แป้งมัน 10 กรัม\n"
          "3.สีผสมอาหาร อย่างละ 4 หยด (สีม่วง / สีฟ้า/ สีเขียว / สีเหลือง / สีแดง)\n"
          "4.น้ำดื่ม\n"
          "น้ำกะทิ\n"
          "1.กะทิ 4 ถ้วย (หางกะทิ 2 ถ้วย + หัวกะทิ 2 ถ้วย)\n"
          "2.น้ำตาลปี๊บ 100 กรัม\n"
          "3.น้ำตาลทราย 80 กรัม\n"
          "4.เกลือป่น 1/4 ช้อนโต๊ะ\n"
          "5.มะพร้าวอ่อนหั่นชิ้นพอคำ 50 กรัม\n"
          "6.ไข่ไก่ 2 ฟอง (ใส่เพิ่มได้ตามต้องการ)",
      description:
          "1.ใส่แป้งข้าวเหนียว แป้งมัน และสีผสมอาหารลงในชาม ค่อย ๆ ใส่น้ำลงพร้อมกับนวดให้แป้งเป็นเนื้อเดียวกัน\n"
          "2.ทำแป้งให้ครบทุกสี แล้วคลุมพลาสติกแรปพักไว้\n"
          "3.นำแป้งมาปั้นเป็นก้อนกลมเล็ก ๆ  แล้วนำไปต้มในน้ำเดือด พอแป้งลอยขึ้นมา ให้ตักขึ้นพักไว้ในน้ำเย็น\n"
          "4.นำหม้อขึ้นตั้งเตา ใส่หางกะทิ น้ำตาลปี๊บ น้ำตาลทราย และเกลือ คนให้ส่วนผสมเข้ากัน\n"
          "5.ตอกไข่ลงในน้ำกะทิทีละฟอง เมื่อไข่สุกตักขึ้นพักไว้\n"
          "6.เติมหัวกะทิลงไป คนให้ส่วนผสมเข้ากัน ใส่แป้งบัวลอย และมะพร้าวอ่อนลงไป แล้วต้มอย่างน้อย 10 นาที ตักใส่ถ้วย เสิร์ฟพร้อมไข่หวาน",
      image:"assets/images/19.png"
  ),
  Dessert(
      id : 20,
      name: "เม็ดขนุน",
      iconImage:"assets/images/s20.png",
      type: "ขนมไทย",
      ingredient:
          "1.ถั่วเขียวเลาะเปลือกนึ่งและบด 250 กรัม\n"
          "2.น้ำตาลทราย 80 กรัม (สำหรับทำไส้ถั่ว)\n"
          "3.กะทิ 150 มิลลิลิตร\n"
          "4.ไข่แดงของไข่เป็ด 3 ฟอง\n"
          "5.น้ำเปล่า 3 ถ้วยตวง\n"
          "6.น้ำตาลทราย 3 ถ้วยตวง (สำหรับทำน้ำเชื่อม)\n"
          "7.ใบเตยมัด 1 มัด\n"
          "8.กลิ่นมะลิ ½ ช้อนชา",
      description:
          "1.เทถั่วเขียวนึ่งและบดเรียบร้อยแล้วลงในกระทะ ตามด้วยน้ำตาลทราย (สำหรับทำไส้ถั่ว) และกะทิลงไป ผัดด้วยไฟกลางจนส่วนผสมทั้งหมดเข้ากันและแห้งดีแล้วปิดเตา\n"
          "2.นวดขนมอีกครั้งให้เป็นก้อนแล้วพักไว้รอให้อุ่น ๆ จากนั้นปั้นขนมเป็นก้อน ๆให้มีลักษณะเหมือนเม็ดขนุน\n"
          "3.ใส่น้ำ น้ำตาลทราย (สำหรับทำน้ำเชื่อม) ใบเตยมัด และกลิ่นมะลิลงในกะทะทองเหลือง หรือภาชนะก้นลึกที่สามารถตั้งไฟได้ เคี่ยวน้ำเชื่อมจนเหนียวเป็นยางมะตูมแล้วปิดไฟ\n"
          "4.ตีไข่แดงให้พอแตก นำแป้งที่ปั้นเป็นเม็ดขนุนลงไปชุบไข่แดงให้ทั่ว แล้วหยอดลงไปในหม้อน้ำเชื่อจนหมด\n"
          "5.เสร็จแล้วจึงนำน้ำเชื่อมกลับไปตั้งไฟ โดยใช้ไฟอ่อนอีกครั้ง ขั้นตอนนี้จะต้องให้น้ำเชื่อมนิ่งไม่มีการเดือดใดๆ\n"
          "6.เมื่อขนมสุกแล้วก็ใช้กระชอนตักขึ้นมาเสิร์ฟในจาน",
      image:"assets/images/20.png"
  ),
  // ice cream
  Dessert(
      id : 21,
      name: "ไอติมมะพร้าว",
      iconImage:"assets/images/s21.png",
      type: "ไอศกรีม&ของหวาน",
      ingredient:
          "1.นมสด 250 กรัม\n"
          "2.วิปปิ้งครีม 250 กรัม\n"
          "3.น้ำมะพร้าว 250 กรัม\n"
          "4.น้ำตาลทราย 185 กรัม\n"
          "5.เกลือป่น ¼ ช้อนชา\n"
          "6.เนื้อมะพร้าวอ่อน",
      description:
      "1.นำหม้อตั้งไฟอ่อน ใส่นมสด วิปปิ้งครีม น้ำมะพร้าว น้ำตาลทรายและเกลือ ลงไปต้มจนเดือด\n"
          "2.เติมเนื้อมะพร้าวลงไปแล้วต้มให้เดือดอีกครั้ง\n"
          "3.พักส่วนผสมให้เย็น เทส่วนผสมลงกล่องพลาสติก แล้วนำไปแช่ช่องฟรีซ นำออกมากวนทุก 1 ชั่วโมง จนกว่าจะได้ไอศกรีมเนื้อเนียนนุ่ม พร้อมเสิร์ฟ",
      image:"assets/images/21.png"
  ),
  Dessert(
      id : 22,
      name: "ไอติมช็อกโกแลต",
      iconImage:"assets/images/s22.png",
      type: "ไอศกรีม&ของหวาน",
      ingredient:
          "1.นมข้นหวาน 80 มิลลิลิตร\n"
          "2.ผงโกโก้  5 ช้อนโต๊ะ\n"
          "3.นมข้นจืด 80 มิลลิลิตร\n"
          "4.นมสดรสจืด 80 มิลลิลิตร",
      description:
      "1.นำนมสดไปอุ่นในไมโครเวฟให้พออุ่น นำผงโกโก้ผสมลงไปในนมอุ่น คนให้ผงโกโก้ละลาย\n"
          "2.เติมนมข้นหวานและนมข้นจืดลงไป ผสมให้เข้ากันแล้วเทใส่กล่องพลาสติก\n"
          "3.นำส่วนผสมไปแช่ในช่องฟรีซ นำออกมาคนทุกๆ 1 ชั่วโมงจนกว่าไอศกรีมจะเนียน พร้อมเสิร์ฟ",
      image:"assets/images/22.png"
  ),
  Dessert(
      id : 23,
      name: "ไอติมสตรอเบอรี่",
      iconImage:"assets/images/s23.png",
      type: "ไอศกรีม&ของหวาน",
      ingredient:
          "1.สตรอเบอรี่ 15 ลูก\n"
          "2.นมสด 200 มิลลิลิตร\n"
          "3.วิปปิ้งครีม 200 มิลลิลิตร\n"
          "4.เกลือ 1 หยิบมือ\n"
          "5.ไข่ไก่ 1 ฟอง\n"
          "6.มะนาว 1 ช้อนโต๊ะ\n"
          "7.น้ำตาลทราย 80 กรัม แบ่ง ไปบมสตอเบอร์รี่ครึ่งหนึ่ง และอีกครึ่งเป็นส่วนผสมของนม",
      description:
          "1.นำสตรอเบอรี่สดไปแช่แข็ง เมื่อแข็งแล้วนำมาบมด้วยน้ำตาลและมะนาว บมทิ้งไว้ 30 นาที\n"
          "2.ระหว่างรอสตรอเบอรี่ที่บมไว้ ให้นำไข่ไก่ใส่ลงไปในอ่างผสม ใส่น้ำตาลทรายและเกลือลงไป ตีจนขึ้นฟูเป็นสีขาว\n"
          "3.เทนมสดลงไปในไข่ที่ตีไว้ คนให้เข้ากัน นำสตรอเบอรี่ที่บมไว้ได้ที่แล้ว ใส่ลงไปในชามผสม\n"
          "4.นำส่วนผสมทั้งหมดลงปั่น ไม่ต้องให้สตรอเบอรี่ละเอียดมาก\n"
          "5.นำส่วนผสมเทลงกล่องถนอมอาหารที่มีฝาปิดมิดชิด ตามด้วยวิปปิ้งครีม คนให้เข้ากัน\n"
          "6.นำไปแช่ตู้เย็นในช่องแช่แข็ง แช่ 2 ชั่วโมงให้นำออกมากวน แล้วนำเข้าตู้เย็นอีกครั้ง แช่ไว้ 5 ชั่วโมงก็ใช้ได้ หรืออาจจะใช้เวลามากกว่านั้น ขึ้นอยู่กับตู้เย็น จากนั้นจัดจาน พร้อมเสิร์ฟ",
      image:"assets/images/23.png"
  ),
  Dessert(
      id : 24,
      name: "วาฟเฟิลไอศกรีม",
      iconImage:"assets/images/s24.png",
      type: "ไอศกรีม&ของหวาน",
      ingredient:
          "1.ไข่ไก่ 3 ฟอง\n"
          "2.น้ำตาลทราย 100 กรัม\n"
          "3.แป้งสาลีอเนกประสงค์ 150 กรัม\n"
          "4.ผงฟู 1 ช้อนชา\n"
          "5.นมสด 300 มิลลิลิตร\n"
          "6.เนย 50 กรัม\n"
          "7.กลิ่นวานิลลา 1 ช้อนชา\n"
          "8.ไอศกรีมตามชอบ\n"
          "9.ซอสคาราเมล\n"
          "10.ซอสช็อกโกแลต\n"
          "11.ท็อปปิ้งตามชอบ\n"
          "12.น้ำตาลไอซิ่ง\n"
          "13.เครื่องทำวาฟเฟิล",
      description:
          "1.ตีไข่ไก่กับน้ำตาลทรายให้ขึ้นฟู\n"
          "2.ใส่แป้งสาลีอเนกประสงค์ ผงฟู (ที่ร่อนเอาไว้แล้ว) นม เนยละลาย และกลิ่นวานิลลา ตีจนเข้ากัน\n"
          "3.ทาเนยที่เครื่องทำวาฟเฟิล เทส่วนผสมแป้งลงไปพอประมาณ อบวาฟเฟิลประมาณ 2 นาที\n"
          "4.พอได้วาฟเฟิล ก็จัดการใส่ไอศกรีมตามชอบลงบนวาฟเฟิล ราดซอสคาราเมล\n"
          "5.นำวาฟเฟิลอีก 1 แผ่นมาทับไอศกรีม แล้วใส่ท็อปปิ้งตามชอบ\n"
          "6.ราดซอสช็อกโกแลต โรยไอซิ่งตกแต่ง พร้อมเสิร์ฟ",
      image:"assets/images/24.png"
  ),
  Dessert(
      id : 25,
      name: "ไอศกรีมแพนเค้ก",
      iconImage:"assets/images/s25.png",
      type: "ไอศกรีม&ของหวาน",
      ingredient:
          "1.ไข่แดง 4 ฟอง\n"
          "2.กลิ่นวานิลลา ½ ช้อนชา\n"
          "3.นมข้นจืด 50 กรัม\n"
          "4.แป้งเค้ก 60 กรัม\n"
          "5.ผงฟู ½ ช้อนชา\n"
          "6.เกลือ ¼ ช้อนชา\n"
          "7.เนยจืดละลาย 2 ช้อนโต๊ะ\n"
          "8.ครีม ออฟ ทาร์ทาร์ ½ ช้อนชา\n"
          "9.ไข่ขาว 4 ฟอง\n"
          "10.น้ำตาลทราย 30 กรัม\n"
          "11.ท้อปปิ้งตามชอบ",
      description:
          "1.ทุบน้ำแข็งแห้งให้ละเอียด\n"
          "2.ผสมวิปปิ้งครีม เกลือ และ นมข้นหวาน\n"
          "3.ใส่น้ำแข็งแห้งป่นละเอียดลงในส่วนผสมไอศกรีม คอยคนเรื่อย ๆ เพื่อให้ความเย็นกระจายอย่างทั่วถึง\n"
          "4.เมื่อส่วนผสมจับตัวเป็นไอศกรีมแล้ว ตักเป็นลูกใส่ไว้ในช่องแช่แข็ง\n"
          "5.ร่อนแป้งเค้ก ผงฟู และเกลือ ผสมกับไข่แดง เนยจืดละลาย และ ข้นจืด คนให้เข้ากันแล้วพักไว้ในตู้เย็นนาน 10 - 15 นาที\n"
          "6.ตีไข่ขาวกับ ครีม ออฟ ทาร์ทาร์ จนพอขึ้นฟู\n"
          "7.ใส่น้ำตาลทีละน้อย สลับกับตีด้วยความเร็วสูงจนกระทั่งใส่น้ำตาลหมด ตีต่อด้วยความเร็วสูงจนไข่ขาวตั้งยอดแข็ง และเนื้อเนียนละเอียด\n"
          "8.นำไข่ขาวที่ตีจนขึ้นฟูมาผสมลงกับส่วนผสมแป้งแพนเค้ก โดยแบ่งผสม 3 ครั้ง ตะล่อมเบา ๆ จนเนื้อแป้งแพนเค้กกับไข่ขาวเข้ากันดี\n"
          "9.นำกระทะขึ้นตั้งไฟปานกลาง ทาเนยบาง ๆ ให้ทั่ว วางพิมพ์กลมพร้อมกระดาษรองอบลงไป แล้วรอจนร้อน\n"
          "10. ตักแป้งแพนเค้กที่ผสมเข้ากันดีแล้วหยอดลงในกระทะ แล้วปรับเป็นไฟเบาทันที หยอดแป้งแพนเค้กซ้ำลงตรงกลางให้เป็นยอดสูง\n"
          "11.ปิดฝา รอจนแป้งเริ่มสุกแล้วจึงกลับด้านแพนเค้ก ทอดต่อจนหน้าแพนเค้กขึ้นสีแล้วจึงตักออกใส่จาน\n"
          "12.ตักไอศกรีมวางลงไป ตกแต่งด้วยท้อปปิ้ง ราดด้วยน้ำผึ้ง พร้อมเสิร์ฟ",
      image:"assets/images/25.png"
  ),
  Dessert(
      id : 26,
      name: "ฮันนี่โทสต์",
      iconImage:"assets/images/s26.png",
      type: "ไอศกรีม&ของหวาน",
      ingredient:
          "1.ขนมปังปอนด์ 1 แถวเล็ก\n"
          "2.เนยเค็มหั่นบาง ๆ 200 กรัม\n"
          "3.ไอศกรีม 1 ลูก (เลือกรสชาติได้ตามใจชอบ)\n"
          "4.วิปครีม สำหรับเสิร์ฟ\n"
          "5.น้ำผึ้ง สำหรับราด\n"
          "6.ท้อปปิ้งตามชอบ",
      description:
          "1.นำขนมปังปอนด์มาหั่นเป็นตาราง\n"
          "2.ใส่เนยลงไปตามช่องที่หั่นไว้ และบนหน้าขนมปังด้วย\n"
          "3.นำขนมปังไปเข้าไมโครเวฟประมาณ 2 นาที โดยใช้ความร้อน 800 วัตต์\n"
          "4.นำออกมาจัดเสิร์ฟกับท้อปปิ้ง ไอศกรีม และวิปครีม ราดด้วยน้ำผึ้ง จัดจานพร้อมเสิร์ฟ",
      image:"assets/images/26.png"
  ),
  Dessert(
      id : 27,
      name: "บิงซูผลไม้รวม",
      iconImage:"assets/images/s27.png",
      type: "ไอศกรีม&ของหวาน",
      ingredient:
          "1.นมสดรสจืด 1 ถ้วย\n"
          "2.ครีม 1 ถ้วย\n"
          "3.น้ำเชื่อม 1/4 ถ้วย\n"
          "4.ผงวานิลลา 30 กรัม\n"
          "5.สับปะรด,เมล่อน,แตงโม,แคนตาลูป หรือผลไม้ชนิดใดก็ได้ตามชอบ",
      description:
          "1.ผสมนมสด ครีม น้ำเชื่อม และผงวานิลลาเข้าด้วยกัน จากนั้นก็นำไปใส่ในถุงซิปล็อค\n"
          "2.นำนมไปแช่ประมาณ 5 ชั่วโมง หรือข้ามคืน\n"
          "3.หั่นผลไม้ให้พอดีคำตามต้องการ\n"
          "4.นำนมที่แช่แข็งออกมาทุบให้ละเอียด แล้วตักใส่ถ้วย\n"
          "5.ตกแต่งเอาผลไม้มาวางบนเกล็ดน้ำแข็ง พร้อมเสิร์ฟ",
      image:"assets/images/27.png"
  ),
  Dessert(
      id : 28,
      name: "นมเปรี้ยวบิงซู",
      iconImage:"assets/images/s28.png",
      type: "ไอศกรีม&ของหวาน",
      ingredient:
          "1.ขนมปังหั่นเป็นสี่เหลี่ยมชิ้นพอดีคำ\n"
          "2.นมเปรี้ยวรสผลไม้ที่ชอบ 1 กล่อง (ในที่นี้ใช้รสสตรอว์เบอร์รี)\n"
          "3.วิปปิ้งครีม\n"
          "4.ท้อปปิ้งต่าง ๆ ตามชอบ\n"
          "5.เครื่องปั่น\n"
          "6.พิมพ์ทำน้ำแข็ง\n"
          "7.แก้วไอศกรีมทรงสูง หรือแก้วน้ำทรงสูง",
      description:
          "1.นำนมเปรี้ยวเทลงไปในพิมพ์ทำน้ำแข็ง ใส่ช่องแช่แข็งทิ้งไว้จนจับตัวเป็นก้อน (ราว 4-5 ชั่วโมง หรือทิ้งไว้ข้ามคืน)\n"
          "2.นำขนมปังหั่นเป็นสี่เหลี่ยม ใส่แก้วไอศกรีมทรงสูง หรือแก้วที่เตรียมไว้\n"
          "3.นำนมเปรี้ยวที่แช่จนเป็นก้อนน้ำแข็งแล้ว มาปั่นในเครื่องปั่น เทลงไปด้านบนขนมปัง\n"
          "4.บีบวิปปิ้งครีมใส่ลงไป\n"
          "5.ตกแต่งหน้าด้วยท้อปปิ้งตามใจชอบ\n"
          "6.ราดซอสหรือนมเปรี้ยวรสที่ชอบ พร้อมเสิร์ฟ",
      image:"assets/images/28.png"
  ),
  Dessert(
      id : 29,
      name: "น้ำแข็งใสโบราณ",
      type: "ไอศกรีม&ของหวาน",
      iconImage:"assets/images/s29.png",
      ingredient:
          "1.น้ำแข็งทุบหรือป่น\n"
          "2.นมข้นหวาน\n"
          "3.นมสด\n"
          "4.น้ำผึ้ง\n"
          "5.ท้อปปิ้งตามชอบ",
      description:
          "1.น้ำแข็งใส่ลงไปในเครื่องปั่นน้ำผลไม้ ระหว่างปั่นใส่นมข้นลงไปหนึ่งในสามปั่นจนละเอียด จะได้น้ำแข็งปั่นคล้ายๆ เกล็ดหิมะ ตักใส่ถ้วยขนม\n"
          "2.จัดเรียงท้อปปิ้งตามชอบ วางลงบนน้ำแข็งปั่น\n"
          "3.ราดทับด้วยนมสด น้ำผึ้ง ตามชอบ อาจเพิ่มวิปครีมและไอศกรีมเข้าไปเพื่อเพิ่มสีสันให้น่าทานมากขึ้น",
      image:"assets/images/29.png"
  ),
  // drink
  Dessert(
      id : 30,
      name: "ชาไทย",
      iconImage:"assets/images/s30.png",
      type: "เครื่องดื่ม",
      ingredient:
          "1.ถุงกรองชา\n"
          "2.เหยือกสูงทนความร้อน\n"
          "3.ผงชาไทย 5 ช้อนโต๊ะ\n"
          "4.น้ำต้มเดือด 2 1/2 ถ้วย\n"
          "5.น้ำตาลทราย 1/2 ถ้วย\n"
          "6.นมข้นหวาน 3 ช้อนโต๊ะ\n"
          "7.นมข้นจืด สำหรับราดหน้า\n"
          "8.น้ำแข็ง",
      description:
          "1.ใส่ผงชาไทยลงในถุงกรองชาที่รองด้วยเหยือกสูงทนความร้อน จากนั้นเทน้ำร้อนใส่ลงไปจนท่วมใบชา เขย่าถุงกรองชาไปมาเพื่อให้ใบชาโดนน้ำจนทั่วแล้วพักทิ้งไว้ประมาณ 15 นาที\n"
          "2.ใส่น้ำตาลทรายและนมข้นหวานลงในแก้วผสม เตรียมไว้\n"
          "3.พอครบ 15 นาที ขยับถุงชาเล็กน้อย จากนั้นยกขึ้นแล้วเทน้ำชาไทยที่กรองแล้วในน้ำตาลทรายคนให้เข้ากันจนละลาย พักทิ้งไว้ประมาณ 5-10 นาทีเพื่อให้เย็นลง\n"
          "4.ใส่น้ำแข็งลงในแก้ว เทชาไทยลงไปประมาณ 3/4 ส่วน\n"
          "5.ราดนมข้นจืดลงไป พร้อมเสิร์ฟ",
      image:"assets/images/30.png"
  ),
  Dessert(
      id : 31,
      name: "ชาเขียวนมสด",
      iconImage:"assets/images/s31.png",
      type: "เครื่องดื่ม",
      ingredient:
          "1.ผงชาเขียว 1 ช้อนโต๊ะ\n"
          "2.นมข้นหวาน 1 ช็อต\n"
          "3.นมข้นจืด 1 ช็อต\n"
          "4.นมสด 2 ช็อต",
      description:
          "1.นำผงชาเขียวต้มในน้ำร้อน 50 มล.\n"
          "2.นำน้ำชาเขียวมาผสมกับนมข้น ผสมให้เข้ากันจนนมข้นหวานละลาย\n"
          "3.ใส่นมข้นจืดและนมสด\n"
          "4.เทใส่แก้วน้ำแข็งพร้อมเสิร์ฟ",
      image:"assets/images/31.png"
  ),
  Dessert(
      id : 32,
      name: "โกโก้",
      iconImage:"assets/images/s32.png",
      type: "เครื่องดื่ม",
      ingredient:
          "1.น้ำร้อน\n"
          "2.ผงโกโก้\n"
          "3.น้ำตาลทรายแดง\n"
          "4.นมข้นหวาน\n"
          "5.นมข้นจืด\n"
          "6.นมสด\n"
          "7.ครีมเทียม",
      description:
          "1.เทน้ำร้อนใส่แก้ว ตักผลโกโก้ ประมาณ 2 ช้อนชา\n"
          "2.ใส่ครีมเที่ยม 1 ช้อนชา ละลายผงโกโก้และครีมเทียมให้เข้ากัน จากนั้นกดน้ำร้อนใส่อีกครึ่งแก้วแล้วค่อยใส่น้ำตาลทรายแดง 1 ช้อนชาใส่นมข้นหวาน 30 mlใส่นมข้นจืด 30 ml และนมสด 40 ml\n"
          "3. ละลายให้เข้ากัน ใส่น้ำแข็งเทโกโก้ที่ชงใส่ แล้วใช้นมสดที่เหลือเทลงไปชั้นบน",
      image:"assets/images/32.png"
  ),
  Dessert(
      id : 33,
      name: "นมเย็น",
      iconImage:"assets/images/s33.png",
      type: "เครื่องดื่ม",
      ingredient:
          "1.น้ำแดง 1/2 ถ้วย\n"
          "2.น้ำอุ่น 1/4 ถ้วย\n"
          "3.นมข้นหวาน 2 ช้อนโต๊ะ\n"
          "4.นมข้นจืด 4 ช้อนโต๊ะ\n",
      description:
          "1.เตรียมแก้วสำหรับชง ผสมน้ำแดง น้ำอุ่น นมข้นจืดและนมข้นหวาน ชงให้เข้ากัน\n"
          "2.ตักน้ำแข็งป่นใส่ให้เต็มแก้ว เทนมชมพูลงไป ราดหน้าด้วยนมข้นจืดอีกครั้ง เพื่อความหวานมันเข้มข้น",
      image:"assets/images/33.png"
  ),
  Dessert(
      id : 34,
      name: "ชามะนาว",
      iconImage:"assets/images/s34.png",
      type: "เครื่องดื่ม",
      ingredient:
          "1.ผงชาตรามือ 2 ช้อนโต๊ะ\n"
          "2.น้ำร้อน 1 แก้ว\n"
          "3.น้ำตาลทราย 2 ช้อนชา\n"
          "4.เกลือ 1/2 ช้อนชา\n"
          "5.มะนาว 1 1/2 ลูก\n"
          "6.น้ำแข็ง 1 แก้ว",
      description:
          "1.ชงชาด้วยน้ำร้อน ใส่น้ำตาลทราย เกลือ และ มะนาวลงไป คนให้เข้ากัน ชิมรสตามชอบ\n"
          "2.ใส่น้ำแข็งลงแก้ว เทชาลงไป พร้อมเสิร์ฟ",
      image:"assets/images/34.png"
  ),
  Dessert(
      id : 35,
      name: "น้ำบ๊วย",
      iconImage:"assets/images/s35.png",
      type: "เครื่องดื่ม",
      ingredient:
          "1.บ๊วยดอง 2 เม็ด\n"
          "2.น้ำบ๊วย 2 ช้อนชา\n"
          "3.น้ำตาลหญ้าหวาน 2 ช้อนชา\n"
          "4.มะนาวคั้นสด 1 ลูก\n"
          "5.น้ำร้อน 50 ml\n"
          "6.โซดา 1 แก้ว\n"
          "7.น้ำแข็ง 1 แก้ว",
      description:
          "1.ตักลูกบ๊วยและน้ำบ๊วยใส่แก้วใส่น้ำตาลหญ้าหวาน บดเนื้อบ๊วยให้แตก\n"
          "2.เติมน้ำร้อนนิดหน่อยคนให้ละลายและเติมน้ำมะนาวคนให้เข้ากัน ชิมรส\n"
          "3.ตักน้ำแข็งใส่แก้ว และเทน้ำบ๊วยลงครึ่งแก้วแล้วเติมโซดาอีกครึ่งแก้ว พร้อมเสิร์ฟ",
      image:"assets/images/35.png"
  ),
  Dessert(
      id : 36,
      name: "โอเลี้ยง",
      iconImage:"assets/images/s36.png",
      type: "เครื่องดื่ม",
      ingredient:
          "1.ผงโอเลี้ยง 5-6 ช้อนโต๊ะ\n"
          "2.น้ำ 1 1/2 ถ้วย\n"
          "3.น้ำตาลทราย 10 ช้อนโต๊ะ\n"
          "4.น้ำแข็ง\n"
          "5.เหยือกสเตนเลส\n"
          "6.ถุงกรองกาแฟ",
      description:
          "1.ต้มน้ำเดือด เตรียมไว้\n"
          "2.ใส่ผงโอเลี้ยงลงในถุงกาแฟ นำไปวางลงในเหยือกสเตนเลส เทน้ำเดือดลงไป เขย่าถุงเล็กน้อยให้น้ำทั่วถึงกาแฟ พักทิ้งไว้ 7-10 นาที\n"
          "3.ใส่น้ำตาลลงในแก้วตามชอบ เทโอเลี้ยงตามลงไปคนผสมให้น้ำตาลทรายละลาย เทใส่แก้วที่มีน้ำแข็งจนเต็ม พร้อมเสิร์ฟ",
      image:"assets/images/36.png"
  ),
  Dessert(
      id : 37,
      name: "ชานมไข่มุก",
      iconImage:"assets/images/s37.png",
      type: "เครื่องดื่ม",
      ingredient:
          "1.น้ำชา (ใบชาไต้หวันพรีเมียม) ที่ต้มแล้ว 120 มิลลิลิตร\n"
          "2.นมข้นหวาน 45 มิลลิลิตร\n"
          "3.นมสด 60 มิลลิลิตร\n"
          "4.ครีมเทียม 1 ช้อนชา\n"
          "5.ไข่มุก\n"
          "6.น้ำแข็ง",
      description:
          "1.นำน้ำชาที่ต้มไว้ มาผสมเข้ากับนมข้นหวาน นมสด ครีมเทียมที่เตรียมไว้\n"
          "2.จากนั้นคนละลายให้เข้ากัน\n"
          "3.ตักน้ำแข็งใส่แก้วที่เตรียมไว้จากนั้นค่อย ๆเทส่วนผสมทั้งหมดลงในแก้ว\n"
          "4.ตกแต่งด้วยไข่มุกด้านบนให้สวยงาม",
      image:"assets/images/37.png"
  ),
  Dessert(
      id : 38,
      name: "นมหมีปั่น",
      iconImage:"assets/images/s38.png",
      type: "เครื่องดื่ม",
      ingredient:
          "1.นมตราหมี (รสชาติตามชอบ)\n"
          "2.นมข้นหวาน\n"
          "3.นมข้นจืด\n"
          "4.น้ำเชื่อม\n"
          "5.น้ำแข็ง 1 แก้ว\n"
          "6.ท็อปปิ้งตามชอบ",
      description:
          "1.ใส่น้ำแข็งลงในเครื่องปั่น เทนมตราหมีใส่ลงไป ตามด้วยนมข้นหวาน นมข้นจืด และน้ำเชื่อม\n"
          "2.ปั่นผสมทุกอย่างจนเนื้อเนียน เทใส่แก้ว แต่งด้วยท็อปปิ้งตามชอบ",
      image:"assets/images/38.png"
  ),
  Dessert(
      id : 39,
      name: "โยเกิร์ตสมูทตี้",
      iconImage:"assets/images/s39.png",
      type: "เครื่องดื่ม",
      ingredient:
          "1.สตรอเบอรี่แช่แข็ง 3-5 ลูก\n"
          "2.น้ำสตรอเบอรี่เข้มข้น (ติ่งฟง) 2-3 ออนซ์\n"
          "3.น้ำเชื่อม 2-3 ช้อนโต๊ะ\n"
          "4.น้ำเปล่า 2 ออนซ์\n"
          "5.น้ำแข็ง\n"
          "6.โยเกิร์ตสตรอเบอรี่/ธรรมชาติ 1/2 ถ้วย\n"
          "7.สตรอเบอรี่ซอสสำหรับราด",
      description:
          "1.นำน้ำแข็ง น้ำสตรอเบอรี่ น้ำเชื่อม น้ำเปล่า ใส่ลงในเครื่องปั่น ปั่นจนเนียน\n"
          "2.ใส่โยเกิร์ตลงไปปั่น\n"
          "3.ตักโยเกิร์ตลงในแก้ว เทสตรอเบอรี่ปั่นตามลงไป\n"
          "4.ราดด้วยสตรอเบอรี่ซอส",
      image:"assets/images/39.png"
  ),
];
