class Drinks{
  final int id;
  final String name;
  final String iconImage;
  final String type;
  final String ingredient;
  final String description;
  final String image;

  Drinks({
    this.id,
    this.name,
    this.iconImage,
    this.type,
    this.ingredient,
    this.description,
    this.image,
  });
}
List<Drinks> drink = [
  Drinks(
      id : 30,
      name: "ชาไทย",
      iconImage:"assets/images/s30.png",
      type: "เครื่องดื่ม",
      ingredient:
      "1.ถุงกรองชา\n"
          "2.เหยือกสูงทนความร้อน\n"
          "3.ผงชาไทย 5 ช้อนโต๊ะ\n"
          "4.น้ำต้มเดือด 2 1/2 ถ้วย\n"
          "5.น้ำตาลทราย 1/2 ถ้วย\n"
          "6.นมข้นหวาน 3 ช้อนโต๊ะ\n"
          "7.นมข้นจืด สำหรับราดหน้า\n"
          "8.น้ำแข็ง",
      description:
      "1.ใส่ผงชาไทยลงในถุงกรองชาที่รองด้วยเหยือกสูงทนความร้อน จากนั้นเทน้ำร้อนใส่ลงไปจนท่วมใบชา เขย่าถุงกรองชาไปมาเพื่อให้ใบชาโดนน้ำจนทั่วแล้วพักทิ้งไว้ประมาณ 15 นาที\n"
          "2.ใส่น้ำตาลทรายและนมข้นหวานลงในแก้วผสม เตรียมไว้\n"
          "3.พอครบ 15 นาที ขยับถุงชาเล็กน้อย จากนั้นยกขึ้นแล้วเทน้ำชาไทยที่กรองแล้วในน้ำตาลทรายคนให้เข้ากันจนละลาย พักทิ้งไว้ประมาณ 5-10 นาทีเพื่อให้เย็นลง\n"
          "4.ใส่น้ำแข็งลงในแก้ว เทชาไทยลงไปประมาณ 3/4 ส่วน\n"
          "5.ราดนมข้นจืดลงไป พร้อมเสิร์ฟ",
      image:"assets/images/30.png"
  ),
  Drinks(
      id : 31,
      name: "ชาเขียวนมสด",
      iconImage:"assets/images/s31.png",
      type: "เครื่องดื่ม",
      ingredient:
      "1.ผงชาเขียว 1 ช้อนโต๊ะ\n"
          "2.นมข้นหวาน 1 ช็อต\n"
          "3.นมข้นจืด 1 ช็อต\n"
          "4.นมสด 2 ช็อต",
      description:
      "1.นำผงชาเขียวต้มในน้ำร้อน 50 มล.\n"
          "2.นำน้ำชาเขียวมาผสมกับนมข้น ผสมให้เข้ากันจนนมข้นหวานละลาย\n"
          "3.ใส่นมข้นจืดและนมสด\n"
          "4.เทใส่แก้วน้ำแข็งพร้อมเสิร์ฟ",
      image:"assets/images/31.png"
  ),
  Drinks(
      id : 32,
      name: "โกโก้",
      iconImage:"assets/images/s32.png",
      type: "เครื่องดื่ม",
      ingredient:
      "1.น้ำร้อน\n"
          "2.ผงโกโก้\n"
          "3.น้ำตาลทรายแดง\n"
          "4.นมข้นหวาน\n"
          "5.นมข้นจืด\n"
          "6.นมสด\n"
          "7.ครีมเทียม",
      description:
      "1.เทน้ำร้อนใส่แก้ว ตักผลโกโก้ ประมาณ 2 ช้อนชา\n"
          "2.ใส่ครีมเที่ยม 1 ช้อนชา ละลายผงโกโก้และครีมเทียมให้เข้ากัน จากนั้นกดน้ำร้อนใส่อีกครึ่งแก้วแล้วค่อยใส่น้ำตาลทรายแดง 1 ช้อนชาใส่นมข้นหวาน 30 mlใส่นมข้นจืด 30 ml และนมสด 40 ml\n"
          "3. ละลายให้เข้ากัน ใส่น้ำแข็งเทโกโก้ที่ชงใส่ แล้วใช้นมสดที่เหลือเทลงไปชั้นบน",
      image:"assets/images/32.png"
  ),
  Drinks(
      id : 33,
      name: "นมเย็น",
      iconImage:"assets/images/s33.png",
      type: "เครื่องดื่ม",
      ingredient:
      "1.น้ำแดง 1/2 ถ้วย\n"
          "2.น้ำอุ่น 1/4 ถ้วย\n"
          "3.นมข้นหวาน 2 ช้อนโต๊ะ\n"
          "4.นมข้นจืด 4 ช้อนโต๊ะ\n",
      description:
      "1.เตรียมแก้วสำหรับชง ผสมน้ำแดง น้ำอุ่น นมข้นจืดและนมข้นหวาน ชงให้เข้ากัน\n"
          "2.ตักน้ำแข็งป่นใส่ให้เต็มแก้ว เทนมชมพูลงไป ราดหน้าด้วยนมข้นจืดอีกครั้ง เพื่อความหวานมันเข้มข้น",
      image:"assets/images/33.png"
  ),
  Drinks(
      id : 34,
      name: "ชามะนาว",
      iconImage:"assets/images/s34.png",
      type: "เครื่องดื่ม",
      ingredient:
      "1.ผงชาตรามือ 2 ช้อนโต๊ะ\n"
          "2.น้ำร้อน 1 แก้ว\n"
          "3.น้ำตาลทราย 2 ช้อนชา\n"
          "4.เกลือ 1/2 ช้อนชา\n"
          "5.มะนาว 1 1/2 ลูก\n"
          "6.น้ำแข็ง 1 แก้ว",
      description:
      "1.ชงชาด้วยน้ำร้อน ใส่น้ำตาลทราย เกลือ และ มะนาวลงไป คนให้เข้ากัน ชิมรสตามชอบ\n"
          "2.ใส่น้ำแข็งลงแก้ว เทชาลงไป พร้อมเสิร์ฟ",
      image:"assets/images/34.png"
  ),
  Drinks(
      id : 35,
      name: "น้ำบ๊วย",
      iconImage:"assets/images/s35.png",
      type: "เครื่องดื่ม",
      ingredient:
      "1.บ๊วยดอง 2 เม็ด\n"
          "2.น้ำบ๊วย 2 ช้อนชา\n"
          "3.น้ำตาลหญ้าหวาน 2 ช้อนชา\n"
          "4.มะนาวคั้นสด 1 ลูก\n"
          "5.น้ำร้อน 50 ml\n"
          "6.โซดา 1 แก้ว\n"
          "7.น้ำแข็ง 1 แก้ว",
      description:
      "1.ตักลูกบ๊วยและน้ำบ๊วยใส่แก้วใส่น้ำตาลหญ้าหวาน บดเนื้อบ๊วยให้แตก\n"
          "2.เติมน้ำร้อนนิดหน่อยคนให้ละลายและเติมน้ำมะนาวคนให้เข้ากัน ชิมรส\n"
          "3.ตักน้ำแข็งใส่แก้ว และเทน้ำบ๊วยลงครึ่งแก้วแล้วเติมโซดาอีกครึ่งแก้ว พร้อมเสิร์ฟ",
      image:"assets/images/35.png"
  ),
  Drinks(
      id : 36,
      name: "โอเลี้ยง",
      iconImage:"assets/images/s36.png",
      type: "เครื่องดื่ม",
      ingredient:
      "1.ผงโอเลี้ยง 5-6 ช้อนโต๊ะ\n"
          "2.น้ำ 1 1/2 ถ้วย\n"
          "3.น้ำตาลทราย 10 ช้อนโต๊ะ\n"
          "4.น้ำแข็ง\n"
          "5.เหยือกสเตนเลส\n"
          "6.ถุงกรองกาแฟ",
      description:
      "1.ต้มน้ำเดือด เตรียมไว้\n"
          "2.ใส่ผงโอเลี้ยงลงในถุงกาแฟ นำไปวางลงในเหยือกสเตนเลส เทน้ำเดือดลงไป เขย่าถุงเล็กน้อยให้น้ำทั่วถึงกาแฟ พักทิ้งไว้ 7-10 นาที\n"
          "3.ใส่น้ำตาลลงในแก้วตามชอบ เทโอเลี้ยงตามลงไปคนผสมให้น้ำตาลทรายละลาย เทใส่แก้วที่มีน้ำแข็งจนเต็ม พร้อมเสิร์ฟ",
      image:"assets/images/36.png"
  ),
  Drinks(
      id : 37,
      name: "ชานมไข่มุก",
      iconImage:"assets/images/s37.png",
      type: "เครื่องดื่ม",
      ingredient:
      "1.น้ำชา (ใบชาไต้หวันพรีเมียม) ที่ต้มแล้ว 120 มิลลิลิตร\n"
          "2.นมข้นหวาน 45 มิลลิลิตร\n"
          "3.นมสด 60 มิลลิลิตร\n"
          "4.ครีมเทียม 1 ช้อนชา\n"
          "5.ไข่มุก\n"
          "6.น้ำแข็ง",
      description:
      "1.นำน้ำชาที่ต้มไว้ มาผสมเข้ากับนมข้นหวาน นมสด ครีมเทียมที่เตรียมไว้\n"
          "2.จากนั้นคนละลายให้เข้ากัน\n"
          "3.ตักน้ำแข็งใส่แก้วที่เตรียมไว้จากนั้นค่อย ๆเทส่วนผสมทั้งหมดลงในแก้ว\n"
          "4.ตกแต่งด้วยไข่มุกด้านบนให้สวยงาม",
      image:"assets/images/37.png"
  ),
  Drinks(
      id : 38,
      name: "นมหมีปั่น",
      iconImage:"assets/images/s38.png",
      type: "เครื่องดื่ม",
      ingredient:
      "1.นมตราหมี (รสชาติตามชอบ)\n"
          "2.นมข้นหวาน\n"
          "3.นมข้นจืด\n"
          "4.น้ำเชื่อม\n"
          "5.น้ำแข็ง 1 แก้ว\n"
          "6.ท็อปปิ้งตามชอบ",
      description:
      "1.ใส่น้ำแข็งลงในเครื่องปั่น เทนมตราหมีใส่ลงไป ตามด้วยนมข้นหวาน นมข้นจืด และน้ำเชื่อม\n"
          "2.ปั่นผสมทุกอย่างจนเนื้อเนียน เทใส่แก้ว แต่งด้วยท็อปปิ้งตามชอบ",
      image:"assets/images/38.png"
  ),
  Drinks(
      id : 39,
      name: "โยเกิร์ตสมูทตี้",
      iconImage:"assets/images/s39.png",
      type: "เครื่องดื่ม",
      ingredient:
      "1.สตรอเบอรี่แช่แข็ง 3-5 ลูก\n"
          "2.น้ำสตรอเบอรี่เข้มข้น (ติ่งฟง) 2-3 ออนซ์\n"
          "3.น้ำเชื่อม 2-3 ช้อนโต๊ะ\n"
          "4.น้ำเปล่า 2 ออนซ์\n"
          "5.น้ำแข็ง\n"
          "6.โยเกิร์ตสตรอเบอรี่/ธรรมชาติ 1/2 ถ้วย\n"
          "7.สตรอเบอรี่ซอสสำหรับราด",
      description:
      "1.นำน้ำแข็ง น้ำสตรอเบอรี่ น้ำเชื่อม น้ำเปล่า ใส่ลงในเครื่องปั่น ปั่นจนเนียน\n"
          "2.ใส่โยเกิร์ตลงไปปั่น\n"
          "3.ตักโยเกิร์ตลงในแก้ว เทสตรอเบอรี่ปั่นตามลงไป\n"
          "4.ราดด้วยสตรอเบอรี่ซอส",
      image:"assets/images/39.png"
  ),
];